{
  "questions": [
    {
      "id": 351,
      "question": [
        {
          "string": "Which Pokémon are fire and bug types?",
          "language": "en"
        },
        {
          "string": "¿Qué Pokémon son de tipos fuego y bicho?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?pokemon WHERE { ?pokemon wdt:P31 wd:Q25930757 . ?pokemon wdt:P31 wd:Q25930490 }",
      "answers": [
        "Q1334381",
        "Q27299994",
        "Q3827231",
        "Q4016093",
        "Q79335533",
        "Q79335562"
      ]
    },
    {
      "id": 173,
      "question": [
        {
          "string": "Who was the U.S. president during the Haditha massacre?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el presidente de los Estados Unidos durante la masacre de Haditha?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39/^wdt:P1313 wd:Q30 . ?obj1 pq:P580 ?obj2 . ?obj1 pq:P582 ?obj3 . wd:Q981327 wdt:P585 ?obj4 .  FILTER(?obj2<=?obj4 && ?obj3>=?obj4) }",
      "answers": [
        "Q207"
      ]
    },
    {
      "id": 166,
      "question": [
        {
          "string": "Where did the 2014 United Nations Climate Change Conference take place?",
          "language": "en"
        },
        {
          "string": "¿Dónde tuvo lugar la Conferencia de las Naciones Unidas sobre el Cambio Climático de 2014?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q15707573 wdt:P276 ?obj }",
      "answers": [
        "Q2868"
      ]
    },
    {
      "id": 339,
      "question": [
        {
          "string": "Who has more children: Lionel Messi or Cristiano Ronaldo?",
          "language": "en"
        },
        {
          "string": "¿Quién tiene más hijos: Lionel Messi o Cristiano Ronaldo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { wd:Q615 wdt:P1971 ?obj1 . wd:Q11571 wdt:P1971 ?obj2 . BIND(IF(?obj1 > ?obj2, wd:Q615, wd:Q11571) AS ?sbj) }",
      "answers": [
        "Q11571"
      ]
    },
    {
      "id": 404,
      "question": [
        {
          "string": "In which year did France last win the Eurovision Song Contest?",
          "language": "en"
        },
        {
          "string": "¿En qué año ganó Francia el Festival de la Canción de Eurovisión por última vez?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { ?sbj (wdt:P31?/(^wdt:P2670)?)|^wdt:P527|wdt:P361|wdt:P179 wd:Q276 . ?sbj wdt:P585 ?obj1 . ?sbj p:P1346/(pq:P17|pq:P1268|ps:P1346|pq:P1532) wd:Q142 .  BIND(YEAR(?obj1) AS ?obj2) } ORDER BY DESC(?obj2) LIMIT 1",
      "answers": [
        "1977"
      ]
    },
    {
      "id": 298,
      "question": [
        {
          "string": "What languages did Kofi Annan speak?",
          "language": "en"
        },
        {
          "string": "¿Qué idiomas hablaba Kofi Annan?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q1254 wdt:P1412 ?obj }",
      "answers": [
        "Q150",
        "Q1860",
        "Q28026"
      ]
    },
    {
      "id": 293,
      "question": [
        {
          "string": "What is the postal code of Alberobello?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el código postal de Alberobello?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q51812 wdt:P281 ?obj }",
      "answers": [
        "70011"
      ]
    },
    {
      "id": 343,
      "question": [
        {
          "string": "How many football players have the family name Suazo?",
          "language": "en"
        },
        {
          "string": "¿Cuántos jugadores de futbol se apellidan Suazo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?sbj) as ?cnt) WHERE { ?sbj wdt:P734 wd:Q37485936. ?sbj wdt:P106 wd:Q937857. }",
      "answers": [
        "8"
      ]
    },
    {
      "id": 290,
      "question": [
        {
          "string": "Which university in Pakistan has the most students?",
          "language": "en"
        },
        {
          "string": "¿Qué universidad en Pakistán tiene el número máximo de estudiantes?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3918 . ?sbj wdt:P131*/wdt:P17?/wdt:P30? wd:Q843 . ?sbj wdt:P2196 ?obj . } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q3694529"
      ]
    },
    {
      "id": 482,
      "question": [
        {
          "string": "How many Asian countries have a female head of state?",
          "language": "en"
        },
        {
          "string": "¿Cuántos países tienen una mujer como jefa de estado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P35 ?obj1 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?obj1 wdt:P21 wd:Q6581072 . ?sbj wdt:P30 wd:Q48 }",
      "answers": [
        "Q668"
      ]
    },
    {
      "id": 342,
      "question": [
        {
          "string": "What is the capital of Qatar?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la capital de Catar?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q846 wdt:P36 ?obj . }",
      "answers": [
        "Q3861"
      ]
    },
    {
      "id": 146,
      "question": [
        {
          "string": "Which countries observe Victory in Europe day?",
          "language": "en"
        },
        {
          "string": "¿Qué países observan el Día de la Victoria en Europa?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE {  ?sbj wdt:P832 wd:Q622365 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . }",
      "answers": [
        "Q142",
        "Q213"
      ]
    },
    {
      "id": 358,
      "question": [
        {
          "string": "Who are Elon Musk's ex-spouses?",
          "language": "en"
        },
        {
          "string": "¿Quiénes son los ex cónyuges de Elon Musk?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q317521 p:P26|^p:P26 ?obj1 . ?obj1 ps:P26 ?obj2 . ?obj1 pq:P582 ?obj3 . }",
      "answers": [
        "Q269309",
        "Q6318376"
      ]
    },
    {
      "id": 324,
      "question": [
        {
          "string": "What was the latest programming language created?",
          "language": "en"
        },
        {
          "string": "¿Cuál fue el último lenguaje de programación creado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?language WHERE { ?language wdt:P31/wdt:P279* wd:Q9143 . ?language wdt:P571 ?fecha . } ORDER BY DESC(?fecha) LIMIT 1",
      "answers": [
        "Q132262426"
      ]
    },
    {
      "id": 143,
      "question": [
        {
          "string": "From which country did Botswana secede?",
          "language": "en"
        },
        {
          "string": "¿De qué país se escindió Botsuana?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { OPTIONAL { wd:Q963 wdt:P807 ?obj1 } OPTIONAL { wd:Q963 wdt:P1365 ?obj2 } OPTIONAL { wd:Q963 wdt:P155 ?obj3 } BIND(COALESCE(?obj1,?obj2,?obj3) AS ?obj) }",
      "answers": [
        "Q145"
      ]
    },
    {
      "id": 208,
      "question": [
        {
          "string": "What philosophers are from the analytic philosophy movement?",
          "language": "en"
        },
        {
          "string": "¿Qué filósofos vienen del movimiento de filosofía analítica?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj { ?sbj wdt:P135 wd:Q183216 . ?sbj wdt:P106/wdt:P276* wd:Q4964182 }",
      "answers": [
        "Q272615",
        "Q9391",
        "Q1087945",
        "Q1701398",
        "Q172544",
        "Q18719173",
        "Q1927910",
        "Q822437",
        "Q725239",
        "Q215263",
        "Q725012",
        "Q340070",
        "Q6074243",
        "Q288756",
        "Q295012",
        "Q60526193",
        "Q319803",
        "Q4725710",
        "Q33760",
        "Q374834"
      ]
    },
    {
      "id": 177,
      "question": [
        {
          "string": "Which movies are based on works written by Philip K. Dick?",
          "language": "en"
        },
        {
          "string": "¿Qué películas se basan en obras escritas por Philip K. Dick?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q11424 . { ?sbj wdt:P144 ?obj1 . ?obj1 wdt:P50 wd:Q171091 . } UNION {?sbj wdt:P1877 wd:Q171091 .} MINUS {?sbj wdt:P629 ?obj2 .} }",
      "answers": [
        "Q13424079",
        "Q1660388",
        "Q184843",
        "Q222018",
        "Q244604",
        "Q247516",
        "Q2601347",
        "Q300547",
        "Q3030131",
        "Q4411138",
        "Q4478964",
        "Q492089",
        "Q555995",
        "Q562396",
        "Q634810",
        "Q728539"
      ]
    },
    {
      "id": 156,
      "question": [
        {
          "string": "Where was Stan Lee born?",
          "language": "en"
        },
        {
          "string": "¿Dónde nació Stan Lee?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q181900 wdt:P19 ?obj }",
      "answers": [
        "Q11299"
      ]
    },
    {
      "id": 128,
      "question": [
        {
          "string": "How many children does Stephen Hawking have?",
          "language": "en"
        },
        {
          "string": "¿Cuántos hijos tiene Stephen Hawking?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { { SELECT (COUNT(*) AS ?obj2) WHERE { wd:Q17714 wdt:P40 ?obj1 . } } OPTIONAL { wd:Q17714 wdt:P1971 ?obj3 . } BIND(COALESCE(?obj2,?obj3) AS ?obj) }",
      "answers": [
        "3"
      ]
    },
    {
      "id": 472,
      "question": [
        {
          "string": "Who wrote the majority opinion on Citizens United v. Federal Election Commission?",
          "language": "en"
        },
        {
          "string": "¿Quién escribió la opinión mayoritaria de Citizens United v. Federal Election Commission?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q1092602 wdt:P5826 ?obj }",
      "answers": [
        "Q11171"
      ]
    },
    {
      "id": 485,
      "question": [
        {
          "string": "How many universities are based in Peru?",
          "language": "en"
        },
        {
          "string": "¿Cuántas universidades hay en Perú?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(DISTINCT ?sbj) AS ?cnt) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3918 . ?sbj wdt:P17 wd:Q419 }",
      "answers": [
        "136"
      ]
    },
    {
      "id": 260,
      "question": [
        {
          "string": "What are the right ascension and declination of CTLGM 3975?",
          "language": "en"
        },
        {
          "string": "¿Cuáles son la ascensión recta y la declinación de CTLGM 3975?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?ra ?dec WHERE { wd:Q86116138 wdt:P6257 ?ra . wd:Q86116138 wdt:P6258 ?dec }",
      "answers": [
        "3.100062263732",
        "-29.67383546166"
      ]
    },
    {
      "id": 403,
      "question": [
        {
          "string": "When was WordLift created?",
          "language": "en"
        },
        {
          "string": "¿Cuándo fue creado WordLift?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?date WHERE {   wd:Q31998763 wdt:P571 ?date . }",
      "answers": [
        "2017-01-01T00:00:00Z"
      ]
    },
    {
      "id": 396,
      "question": [
        {
          "string": "Do Lionel Messi and Cristiano Ronaldo have the same number of children?",
          "language": "en"
        },
        {
          "string": "¿Tienen Lionel Messi y Cristiano Ronaldo el mismo número de hijos?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q615 wdt:P1971 ?obj . wd:Q11571 wdt:P1971 ?obj }",
      "answers": [
        false
      ]
    },
    {
      "id": 504,
      "question": [
        {
          "string": "In which countries is Elon Musk a naturalized citizen?",
          "language": "en"
        },
        {
          "string": "¿En qué países es Elon Musk un ciudadano naturalizado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q317521 p:P27 ?sbj . ?sbj ps:P27 ?obj . ?sbj pq:P828 wd:Q841440 }",
      "answers": [
        "Q16",
        "Q30"
      ]
    },
    {
      "id": 426,
      "question": [
        {
          "string": "On what date is Desmond Tutu's birthday?",
          "language": "en"
        },
        {
          "string": "¿En qué fecha es el cumpleaños de Desmond Tutu?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { { wd:Q43033 wdt:P3150 ?sbj } UNION { wd:Q43033 wdt:P569 ?obj . ?sbj wdt:P31 wd:Q14795564 . ?sbj p:P361 ?obj1 . ?obj1 ps:P361/p:P31/pq:P1545 ?obj2 . ?obj1 pq:P1545 ?obj3 . FILTER(MONTH(?obj) = xsd:integer(?obj2) && DAY(?obj) = xsd:integer(?obj3)) } }",
      "answers": [
        "Q2926"
      ]
    },
    {
      "id": 331,
      "question": [
        {
          "string": "Which movie directed by Stanley Kubrick won the most Academy Awards?",
          "language": "en"
        },
        {
          "string": "¿Qué película dirigida por Stanley Kubrick obtuvo más Premios Óscar?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { { SELECT (MAX(?count) AS ?max) WHERE { SELECT (COUNT(?obj) AS ?count) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q11424 . ?sbj wdt:P57 wd:Q2001 . ?sbj wdt:P166 ?obj . ?obj wdt:P31*/wdt:P279* wd:Q19020 .  } GROUP BY ?sbj } } { SELECT ?sbj (COUNT(?obj) AS ?max) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q11424 . ?sbj wdt:P57 wd:Q2001 . ?sbj wdt:P166 ?obj . ?obj wdt:P31*/wdt:P279* wd:Q19020 .  } GROUP BY ?sbj } }",
      "answers": [
        "Q108297",
        "Q471716"
      ]
    },
    {
      "id": 341,
      "question": [
        {
          "string": "What is the tallest mountain on Earth?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la montaña más alta del mundo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q8502 . ?sbj p:P625/psv:P625/wikibase:geoGlobe wd:Q2 . ?sbj p:P2044/psn:P2044/wikibase:quantityAmount ?obj . } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q121900437"
      ]
    },
    {
      "id": 344,
      "question": [
        {
          "string": "How many goals did Lionel Messi score for FC Barcelona?",
          "language": "en"
        },
        {
          "string": "¿Cuántos goles ha marcado Lionel Messi para el FC Barcelona?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj2 WHERE { wd:Q615 p:P54 ?obj1 . ?obj1 pq:P1351 ?obj2 . ?obj1 ps:P54 wd:Q7156 }",
      "answers": [
        "474.0"
      ]
    },
    {
      "id": 276,
      "question": [
        {
          "string": "What was Mark Twain's birth name?",
          "language": "en"
        },
        {
          "string": "¿Cuál fue el nombre de nacimiento de Mark Twain?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q7245 wdt:P1477 ?obj }",
      "answers": [
        "Samuel Langhorne Clemens"
      ]
    },
    {
      "id": 505,
      "question": [
        {
          "string": "What was the last entirely black and white movie to win an Academy Award for Best Picture?",
          "language": "en"
        },
        {
          "string": "¿Cuál fue la última película enteramente en blanco y negro que ganó un Óscar a la mejor película?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P166 ?obj1 . ?obj1 ps:P166 wd:Q102427 . ?obj1 pq:P585 ?obj2 . ?sbj wdt:P462 wd:Q838368 MINUS { ?sbj wdt:P462 wd:Q22006653 } } ORDER BY DESC(?obj2) LIMIT 1",
      "answers": [
        "Q171861"
      ]
    },
    {
      "id": 255,
      "question": [
        {
          "string": "Did Lionel Messi play with Paris Saint-Germain?",
          "language": "en"
        },
        {
          "string": "¿Jugó Lionel Messi con Paris Saint-Germain?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q615 p:P54 ?obj . ?obj ps:P54 wd:Q483020 . }",
      "answers": [
        true
      ]
    },
    {
      "id": 399,
      "question": [
        {
          "string": "Who holds the record for fastest marathon?",
          "language": "en"
        },
        {
          "string": "¿Quién tiene el récord de la maratón más rápida?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q40244 wdt:P1000 ?obj . }",
      "answers": [
        "Q115601844"
      ]
    },
    {
      "id": 402,
      "question": [
        {
          "string": "Which country in the Balkan region has the lowest nominal gross domestic product per capita?",
          "language": "en"
        },
        {
          "string": "¿Qué país en la región de los Balcanes tiene el producto interno bruto nominal más bajo per cápita?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { { SELECT ?sbj (MAX(?obj2) AS ?obj3) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj p:P1082 ?obj1 . ?obj1 pq:P585 ?obj2 } GROUP BY ?sbj } { SELECT ?sbj (MAX(?obj2) AS ?obj4) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj p:P2131 ?obj1 . ?obj1 pq:P585 ?obj2 } GROUP BY ?sbj } ?sbj p:P1082 ?obj5 . ?obj5 pq:P585 ?obj3 . ?obj5 ps:P1082 ?obj6 . ?sbj p:P2131 ?obj7 . ?obj7 pq:P585 ?obj4 . ?obj7 ps:P2131 ?obj8 . ?sbj wdt:P706|wdt:P361|wdt:P131 wd:Q23522 . BIND(?obj8/?obj6 AS ?obj9) } ORDER BY ?obj9 LIMIT 1",
      "answers": [
        "Q225"
      ]
    },
    {
      "id": 424,
      "question": [
        {
          "string": "On what date is the feast day of Saint Joan of Arc?",
          "language": "en"
        },
        {
          "string": "¿En qué fecha es el Día de Santa Juana de Arco?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q7226 wdt:P841/wdt:P837? ?obj }",
      "answers": [
        "Q2590"
      ]
    },
    {
      "id": 481,
      "question": [
        {
          "string": "Which Asian countries have a female head of state?",
          "language": "en"
        },
        {
          "string": "¿Qué países asiáticos tienen una mujer como jefa de estado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P35 ?obj1 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?obj1 wdt:P21 wd:Q6581072 . ?sbj wdt:P30 wd:Q48 }",
      "answers": [
        "Q668"
      ]
    },
    {
      "id": 210,
      "question": [
        {
          "string": "What was the first movie that Elliot Page starred in?",
          "language": "en"
        },
        {
          "string": "¿Cuál fue la primera película en que protagonizó Elliot Page?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P161 wd:Q173399 . ?sbj wdt:P577 ?obj . ?sbj wdt:P31/wdt:P279* wd:Q11424 } ORDER BY ?obj LIMIT 1",
      "answers": [
        "Q3293618"
      ]
    },
    {
      "id": 192,
      "question": [
        {
          "string": "Who invented LSD?",
          "language": "en"
        },
        {
          "string": "¿Quién inventó LSD?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q23118 wdt:P61 ?obj }",
      "answers": [
        "Q122338"
      ]
    },
    {
      "id": 473,
      "question": [
        {
          "string": "Which countries are part of the G20?",
          "language": "en"
        },
        {
          "string": "¿Qué países forman parte de la G20?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P463 wd:Q19771 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . }",
      "answers": [
        "Q142",
        "Q145",
        "Q148",
        "Q155",
        "Q159",
        "Q16",
        "Q17",
        "Q183",
        "Q252",
        "Q258",
        "Q30",
        "Q38",
        "Q408",
        "Q414",
        "Q43",
        "Q668",
        "Q851",
        "Q884",
        "Q96"
      ]
    },
    {
      "id": 299,
      "question": [
        {
          "string": "What is the fastest species of mammal?",
          "language": "en"
        },
        {
          "string": "¿Qué especie de mamífero es la más rápida?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P2052/psn:P2052/wikibase:quantityAmount ?obj . ?sbj wdt:P105 wd:Q7432 . ?sbj wdt:P171+ wd:Q7377 . } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q913930"
      ]
    },
    {
      "id": 258,
      "question": [
        {
          "string": "Where are the headquarters of FBME Bank?",
          "language": "en"
        },
        {
          "string": "¿Dónde está la sede de FBME Bank?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q5424652 wdt:P159 ?obj }",
      "answers": [
        "Q1960"
      ]
    },
    {
      "id": 446,
      "question": [
        {
          "string": "How many cities are twinned with Port-au-Prince?",
          "language": "en"
        },
        {
          "string": "¿Cuántas ciudades están hermanadas con Puerto Príncipe?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?obj) AS ?cnt) WHERE { wd:Q34261 wdt:P190 ?obj }",
      "answers": [
        "5"
      ]
    },
    {
      "id": 287,
      "question": [
        {
          "string": "Who has run against Jair Bolsonaro for President of Brazil?",
          "language": "en"
        },
        {
          "string": "¿Quién ha enfrentado a Jair Bolsonaro para ser Presidente de Brasil?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { ?sbj wdt:P541 wd:Q5176750 . ?sbj wdt:P726 wd:Q10304982 . ?sbj wdt:P726 ?obj . FILTER(?obj != wd:Q10304982) }",
      "answers": [
        "Q10371678",
        "Q37181",
        "Q59284361",
        "Q744798",
        "Q3069485",
        "Q19944687",
        "Q237693",
        "Q28677087",
        "Q3069485",
        "Q3428247",
        "Q744798",
        "Q964493"
      ]
    },
    {
      "id": 305,
      "question": [
        {
          "string": "In which countries are tepuis found?",
          "language": "en"
        },
        {
          "string": "¿En qué países se encuentran tepuis?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q828329 . ?sbj wdt:P131*/wdt:P17 ?obj }",
      "answers": [
        "Q155",
        "Q717",
        "Q730"
      ]
    },
    {
      "id": 265,
      "question": [
        {
          "string": "What museums are located in Kingston, Jamaica?",
          "language": "en"
        },
        {
          "string": "¿Qué museos están ubicados en Kingston, Jamaica?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q33506 . ?sbj wdt:P276?/wdt:P131* wd:Q34692 }",
      "answers": [
        "Q2498011",
        "Q650517"
      ]
    },
    {
      "id": 423,
      "question": [
        {
          "string": "On what date is Saint Patrick's Day?",
          "language": "en"
        },
        {
          "string": "¿En qué fecha es el Día de San Patricio?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q181817 wdt:P837 ?obj }",
      "answers": [
        "Q2419"
      ]
    },
    {
      "id": 219,
      "question": [
        {
          "string": "Which album followed Another Green World?",
          "language": "en"
        },
        {
          "string": "¿Qué álbum siguió Another Green World?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q771427 wdt:P156|(p:P361/pq:P156) ?obj . ?obj wdt:P31/wdt:P279* wd:Q482994 }",
      "answers": [
        "Q2058212"
      ]
    },
    {
      "id": 296,
      "question": [
        {
          "string": "Who is the current world record holder for the men's 200 meter sprint?",
          "language": "en"
        },
        {
          "string": "¿Quién es el plusmarquista mundial actual de los 200 metros lisos masculinos?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj p:P1000 ?obj1 . ?obj1 ps:P1000 ?obj2 . ?obj2 p:P360 ?obj3 . ?obj3 ps:P360 wd:Q688615 . ?obj3 pq:P641 wd:Q55243755 . MINUS { ?obj1 pq:P582 ?obj4 } }",
      "answers": [
        "Q1189",
        "Q120868534",
        "Q132884102"
      ]
    },
    {
      "id": 447,
      "question": [
        {
          "string": "What gender is Lian Tran?",
          "language": "en"
        },
        {
          "string": "¿De qué género es Lian Tran?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q105159201 wdt:P21 ?obj }",
      "answers": [
        "Q6581072"
      ]
    },
    {
      "id": 302,
      "question": [
        {
          "string": "Who is the manager of Crystal Palace F.C.?",
          "language": "en"
        },
        {
          "string": "¿Quién es el entrenador de Crystal Palace F.C.?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q19467 wdt:P286 ?obj }",
      "answers": [
        "Q874777"
      ]
    },
    {
      "id": 411,
      "question": [
        {
          "string": "In which year did France win the Eurovision Song Contest a third time?",
          "language": "en"
        },
        {
          "string": "¿En qué año ganó Francia el Festival de la Canción de Eurovisión por tercera vez?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { ?sbj (wdt:P31?/(^wdt:P2670)?)|^wdt:P527|wdt:P361|wdt:P179 wd:Q276 . ?sbj wdt:P585 ?obj1 . ?sbj p:P1346/(pq:P17|pq:P1268|ps:P1346|pq:P1532) wd:Q142 . BIND(YEAR(?obj1) AS ?obj2) } ORDER BY ?obj2 OFFSET 2 LIMIT 1",
      "answers": [
        "1962"
      ]
    },
    {
      "id": 376,
      "question": [
        {
          "string": "In which journals has Amrapali Zaveri published?",
          "language": "en"
        },
        {
          "string": "¿En qué revistas ha publicado Amrapali Zaveri?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { ?sbj wdt:P50 wd:Q34315853 . ?sbj wdt:P1433 ?obj . ?obj wdt:P31/wdt:P279* wd:Q41298 }",
      "answers": [
        "Q152037",
        "Q15708881",
        "Q15751858",
        "Q15759214",
        "Q15816960",
        "Q15817015",
        "Q18229272",
        "Q21015572",
        "Q27725928",
        "Q3918707",
        "Q4724371",
        "Q4835939",
        "Q5133783",
        "Q564954",
        "Q6294854",
        "Q924044"
      ]
    },
    {
      "id": 474,
      "question": [
        {
          "string": "What are the members of the G20?",
          "language": "en"
        },
        {
          "string": "¿Cuáles son los miembros de la G20?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P463 wd:Q19771 . }",
      "answers": [
        "Q142",
        "Q145",
        "Q148",
        "Q155",
        "Q159",
        "Q16",
        "Q17",
        "Q183",
        "Q252",
        "Q258",
        "Q30",
        "Q38",
        "Q408",
        "Q414",
        "Q43",
        "Q458",
        "Q668",
        "Q851",
        "Q884",
        "Q96"
      ]
    },
    {
      "id": 397,
      "question": [
        {
          "string": "Who was Donald Trump's first wife?",
          "language": "en"
        },
        {
          "string": "¿Quién fue la primera esposa de Donald Trump?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj2 WHERE { wd:Q22686 p:P26 ?obj1 . ?obj1 ps:P26 ?obj2 . ?obj1 pq:P580 ?obj3 . ?obj2 wdt:P21 wd:Q6581072 . } ORDER BY ?obj3 LIMIT 1",
      "answers": [
        "Q242351"
      ]
    },
    {
      "id": 218,
      "question": [
        {
          "string": "What cities are twinned with Port-au-Prince?",
          "language": "en"
        },
        {
          "string": "¿Qué ciudades están hermanadas con Puerto Príncipe?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q34261 wdt:P190 ?obj }",
      "answers": [
        "Q1335",
        "Q28218",
        "Q340",
        "Q3992",
        "Q8652"
      ]
    },
    {
      "id": 421,
      "question": [
        {
          "string": "Which songs have The Smiths covered and by whom?",
          "language": "en"
        },
        {
          "string": "¿Qué canciones han versionado The Smiths y por quién son?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj1 ?obj2 WHERE { ?sbj wdt:P2550 ?obj1 . ?sbj wdt:P175 wd:Q180598 . ?obj1 wdt:P175 ?obj2 . FILTER(?obj2 != wd:Q180598) }",
      "answers": [
        "Q131324068",
        "Q286525"
      ]
    },
    {
      "id": 431,
      "question": [
        {
          "string": "Which buildings combine funcionalism and brutalism?",
          "language": "en"
        },
        {
          "string": "¿Qué edificios combinan funcionalismo y brutalismo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P149/wdt:P279* wd:Q994776 . ?sbj wdt:P149/wdt:P279* wd:Q47942 . }",
      "answers": [
        "Q110977356",
        "Q115103789",
        "Q136703697",
        "Q136731606",
        "Q137620111",
        "Q7126217"
      ]
    },
    {
      "id": 167,
      "question": [
        {
          "string": "Does the U.S. have a president?",
          "language": "en"
        },
        {
          "string": "¿Tiene los EEUU un presidente?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q30 wdt:P1906 ?obj . ?obj (wdt:P279|wdt:P31)* wd:Q30461 }",
      "answers": [
        true
      ]
    },
    {
      "id": 398,
      "question": [
        {
          "string": "What is the average lifespan of koalas?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la esperanza de vida media de un koala?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q36101 wdt:P2250 ?obj }",
      "answers": [
        "10.0"
      ]
    },
    {
      "id": 163,
      "question": [
        {
          "string": "What is the longest-living species?",
          "language": "en"
        },
        {
          "string": "¿Qué especie es la más longeva?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P105 wd:Q7432 . ?sbj wdt:P4214 ?obj } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q1116374"
      ]
    },
    {
      "id": 456,
      "question": [
        {
          "string": "What is the main religious text of Zoroastrianism?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el texto sagrado principal del zoroastrismo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q9601 wdt:P457 ?obj }",
      "answers": [
        "Q83426"
      ]
    }
  ]
}