{
  "questions": [
    {
      "id": 480,
      "question": [
        {
          "string": "How many countries are part of the G20 but not the Arab League?",
          "language": "en"
        },
        {
          "string": "¿Cuántos países forman parte de la G20 pero no la Liga Árabe?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(DISTINCT ?sbj) AS ?cnt) WHERE { ?sbj wdt:P463 wd:Q19771 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . FILTER NOT EXISTS { ?sbj wdt:P463 wd:Q7172 . } }",
      "answers": [
        "18"
      ]
    },
    {
      "id": 254,
      "question": [
        {
          "string": "When did Lionel Messi transfer to Paris Saint-Germain?",
          "language": "en"
        },
        {
          "string": "¿Cuándo se integró Lionel Messi a Paris Saint-Germain?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q615 p:P54 ?obj . ?obj ps:P54 wd:Q483020 . ?obj pq:P580 ?obj2 . }",
      "answers": [
        "2021-08-01T00:00:00Z"
      ]
    },
    {
      "id": 262,
      "question": [
        {
          "string": "What is Donald Trump's middle name?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el segundo nombre de Donald Trump?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q22686 p:P735 ?obj1 . ?obj1 pq:P1545 \"2\" . ?obj1 ps:P735 ?obj2 . }",
      "answers": [
        "Q4925477"
      ]
    },
    {
      "id": 209,
      "question": [
        {
          "string": "Where is Azar Andami buried?",
          "language": "en"
        },
        {
          "string": "¿Dónde fue enterrada Azar Andami?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q2875087 wdt:P119 ?obj }",
      "answers": [
        "Q814479"
      ]
    },
    {
      "id": 395,
      "question": [
        {
          "string": "Is the Mona Lisa crater found on a planet?",
          "language": "en"
        },
        {
          "string": "¿El cráter de Mona Lisa está en un planeta?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q3320058 wdt:P376 ?obj . ?obj wdt:P31/wdt:P279* wd:Q634 }",
      "answers": [
        true
      ]
    },
    {
      "id": 200,
      "question": [
        {
          "string": "Who publishes the Journal of Visual Literacy?",
          "language": "en"
        },
        {
          "string": "¿Qué editorial publica la Journal of Visual Literacy?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q15762983 wdt:P123 ?obj }",
      "answers": [
        "Q880582"
      ]
    },
    {
      "id": 413,
      "question": [
        {
          "string": "How many times has France won the Eurovision Song Contest?",
          "language": "en"
        },
        {
          "string": "¿Cuántas veces ha ganado Francia el Festival de la Canción de Eurovisión?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(DISTINCT ?sbj) AS ?cnt) { ?sbj (wdt:P31/wdt:P279*)|^wdt:P527|wdt:P361 wd:Q110288240 . ?sbj p:P1346/(pq:P17|ps:P1346) wd:Q142 . }",
      "answers": [
        "0"
      ]
    },
    {
      "id": 275,
      "question": [
        {
          "string": "What is Addis Ababa the capital of?",
          "language": "en"
        },
        {
          "string": "¿De qué es Adís Abeba la capital?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q3624 wdt:P1376 ?obj }",
      "answers": [
        "Q115"
      ]
    },
    {
      "id": 329,
      "question": [
        {
          "string": "Which probes have explored Neptune?",
          "language": "en"
        },
        {
          "string": "¿Qué sondas han explorado Neptuno?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P1444 wd:Q332 }",
      "answers": [
        "Q48475"
      ]
    },
    {
      "id": 222,
      "question": [
        {
          "string": "What color is a starfruit?",
          "language": "en"
        },
        {
          "string": "¿De qué color es una carambola?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q181560 wdt:P462 ?obj }",
      "answers": [
        "Q943"
      ]
    },
    {
      "id": 336,
      "question": [
        {
          "string": "When was the FIFA 2018 World Cup final?",
          "language": "en"
        },
        {
          "string": "¿Cuándo fue la final de la Copa Mundial de Fútbol de 2018?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q170645 wdt:P3967 ?obj1 . ?obj1 wdt:P580 ?obj2 . }",
      "answers": [
        "2018-07-15T00:00:00Z"
      ]
    },
    {
      "id": 135,
      "question": [
        {
          "string": "What is the carbon footprint of CERN?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la huella de carbono de CERN?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q42944 wdt:P5991 ?obj . }",
      "answers": [
        "78169.0"
      ]
    },
    {
      "id": 365,
      "question": [
        {
          "string": "Who are the editors of EMMA?",
          "language": "en"
        },
        {
          "string": "¿Quiénes son los editores de EMMA?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q784201 wdt:P98|wdt:P5769 ?obj .  }",
      "answers": [
        "Q62919"
      ]
    },
    {
      "id": 477,
      "question": [
        {
          "string": "Which countries are part of the G20 and the Arab League?",
          "language": "en"
        },
        {
          "string": "¿Qué países forman parte de la G20 y la Liga Árabe?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P463 wd:Q19771 . ?sbj wdt:P463 wd:Q7172 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 }",
      "answers": [
        "Q851"
      ]
    },
    {
      "id": 139,
      "question": [
        {
          "string": "Which countries border the Black Sea?",
          "language": "en"
        },
        {
          "string": "¿Qué países limitan al Mar Negro?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P206 wd:Q166 . ?sbj wdt:P31 wd:Q3624078 }",
      "answers": [
        "Q159",
        "Q219",
        "Q43"
      ]
    },
    {
      "id": 199,
      "question": [
        {
          "string": "What is the computational complexity of the 2-satisfiability problem?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la complejidad computacional del problema de 2-satisfactibilidad?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q4596967 wdt:P10374 ?obj . }",
      "answers": [
        "Q6954626"
      ]
    },
    {
      "id": 391,
      "question": [
        {
          "string": "Who was the first female president of Chile?",
          "language": "en"
        },
        {
          "string": "¿Quién fue la primera presidenta de Chile?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39 wd:Q466956 . ?obj1 pq:P580 ?obj2 . ?sbj wdt:P21 wd:Q6581072 . } ORDER BY ?obj2 LIMIT 1",
      "answers": [
        "Q320"
      ]
    },
    {
      "id": 176,
      "question": [
        {
          "string": "What is the litter size of a border collie?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el tamaño de camada de una border collie?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q37710 wdt:P7725 ?obj . }",
      "answers": [
        "6.0"
      ]
    },
    {
      "id": 359,
      "question": [
        {
          "string": "Does Elon Musk have an ex-spouse?",
          "language": "en"
        },
        {
          "string": "¿Tiene Elon Musk un ex cónyuge?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q317521 p:P26|^p:P26 ?obj1 . ?obj1 ps:P26 ?obj2 . ?obj1 pq:P582 ?obj3 . }",
      "answers": [
        true
      ]
    },
    {
      "id": 312,
      "question": [
        {
          "string": "When was the Statue of Zeus at Olympia destroyed?",
          "language": "en"
        },
        {
          "string": "¿Cuándo fue destruida la Estatua de Zeus en Olimpia?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q46239 p:P793 ?obj1 . ?obj1 ps:P793 wd:Q17781833 . ?obj1 pq:P585 ?obj2 . }",
      "answers": [
        "0475-01-01T00:00:00Z"
      ]
    },
    {
      "id": 323,
      "question": [
        {
          "string": "Which painter has painted the most paintings?",
          "language": "en"
        },
        {
          "string": "¿Qué pintor ha pintado más obras?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?artist WHERE { ?artist wdt:P106/wdt:P279* wd:Q1028181 . ?artwork wdt:P170 ?artist . ?artwork wdt:P31/wdt:P279* wd:Q3305213 .} GROUP BY (?artist) ORDER BY DESC(COUNT (DISTINCT ?artwork)) LIMIT 1",
      "answers": [
        "Q159758"
      ]
    },
    {
      "id": 409,
      "question": [
        {
          "string": "In which year did France win the Eurovision Song Contest a second time?",
          "language": "en"
        },
        {
          "string": "¿En qué año ganó Francia el Festival de la Canción de Eurovisión por segunda vez?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { ?sbj (wdt:P31?/(^wdt:P2670)?)|^wdt:P527|wdt:P361|wdt:P179 wd:Q276 . ?sbj wdt:P585 ?obj1 . ?sbj p:P1346/(pq:P17|pq:P1268|ps:P1346|pq:P1532) wd:Q142 . BIND(YEAR(?obj1) AS ?obj2) } ORDER BY ?obj2 OFFSET 1 LIMIT 1",
      "answers": [
        "1960"
      ]
    },
    {
      "id": 489,
      "question": [
        {
          "string": "How many matches did Lionel Messi play for FC Barcelona?",
          "language": "en"
        },
        {
          "string": "¿Cuántos partidos jugó Lionel Messi para FC Barcelona?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj2 WHERE { wd:Q615 p:P54 ?obj1 . ?obj1 pq:P1350 ?obj2 . ?obj1 ps:P54 wd:Q7156 }",
      "answers": [
        "520.0"
      ]
    },
    {
      "id": 334,
      "question": [
        {
          "string": "Which countries border Chile?",
          "language": "en"
        },
        {
          "string": "¿Con qué países limita Chile?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q298 wdt:P47 ?obj . ?obj wdt:P31/wdt:P279* wd:Q3624078 }",
      "answers": [
        "Q414",
        "Q419",
        "Q750"
      ]
    },
    {
      "id": 257,
      "question": [
        {
          "string": "What are the subsidiaries of Meta Platforms?",
          "language": "en"
        },
        {
          "string": "¿Qué filiales tiene Meta Platforms?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q380 wdt:P355 ?obj }",
      "answers": [
        "Q106859693",
        "Q106859740",
        "Q107361304",
        "Q110541711",
        "Q16321326",
        "Q17985544",
        "Q19865830",
        "Q209330",
        "Q28943651",
        "Q29123981",
        "Q52410688",
        "Q61058375",
        "Q64732680",
        "Q81063275",
        "Q85760291",
        "Q92586587"
      ]
    },
    {
      "id": 316,
      "question": [
        {
          "string": "In which country was Elon Musk born?",
          "language": "en"
        },
        {
          "string": "¿En qué país nació Elon Musk?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q317521 wdt:P19 ?obj1 . ?obj1 wdt:P17 ?obj2 . }",
      "answers": [
        "Q258"
      ]
    },
    {
      "id": 459,
      "question": [
        {
          "string": "Which carbon isotopes can decay into boron isotopes?",
          "language": "en"
        },
        {
          "string": "¿Qué isótopos de carbono pueden desintegrarse en isótopos de boro?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q471790 . ?sbj wdt:P816 ?obj . ?obj wdt:P31/wdt:P279* wd:Q464352 . }",
      "answers": [
        "Q1014081",
        "Q3658304",
        "Q3658306",
        "Q3658308"
      ]
    },
    {
      "id": 303,
      "question": [
        {
          "string": "What collections outside of Africa exhibit Benin Bronzes?",
          "language": "en"
        },
        {
          "string": "¿Qué colecciones fuera de África exponen Bronces de Benín?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { ?sbj (wdt:P361|wdt:P31)/wdt:P279* wd:Q248101 . ?sbj wdt:P195 ?obj . MINUS { ?obj wdt:P131*/wdt:P17?/wdt:P30? wd:Q15 }  }",
      "answers": [
        "Q160236",
        "Q6373"
      ]
    },
    {
      "id": 470,
      "question": [
        {
          "string": "What proportion of the population of Qatar live in its capital?",
          "language": "en"
        },
        {
          "string": "¿Qué cociente de la población de Catar vive en su capital?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?val WHERE { wd:Q846 wdt:P1082 ?obj1 . wd:Q846 wdt:P36 ?obj2 . ?obj2 wdt:P1082 ?obj3 . BIND(?obj3 / ?obj1 AS ?val) }",
      "answers": [
        "0.4493854413308"
      ]
    },
    {
      "id": 244,
      "question": [
        {
          "string": "What was the latest movie that Lupita Nyong'o starred in?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la última película en que protagonizó Lupita Nyong'o?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P161 wd:Q3840847 . ?sbj wdt:P577 ?obj . ?sbj wdt:P31/wdt:P279* wd:Q11424 . FILTER(?obj < NOW()) } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q130753599"
      ]
    },
    {
      "id": 419,
      "question": [
        {
          "string": "Which paintings are of astronauts?",
          "language": "en"
        },
        {
          "string": "¿Qué cuadros son de astronautas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3305213 . ?sbj wdt:P921 ?obj . ?obj wdt:P106 wd:Q11631 }",
      "answers": [
        "Q47919959",
        "Q47511973",
        "Q47512580",
        "Q47513131",
        "Q47513131",
        "Q47513131",
        "Q47513558",
        "Q47917806",
        "Q47917944",
        "Q47920084",
        "Q47920225",
        "Q47920270",
        "Q119362206",
        "Q47510105",
        "Q47508934",
        "Q47508829",
        "Q47510798"
      ]
    },
    {
      "id": 371,
      "question": [
        {
          "string": "What is the study of fungi?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el estudio de los hongos?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P2578 wd:Q764 }",
      "answers": [
        "Q7175"
      ]
    },
    {
      "id": 360,
      "question": [
        {
          "string": "Which death row prisoners had pizza as their last meal?",
          "language": "en"
        },
        {
          "string": "¿Qué presos condenados a muerte tuvo pizza para su última comida?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P3902/wdt:P279*/wdt:P1056? wd:Q177 . ?sbj wdt:P1196 wd:Q8454 }",
      "answers": [
        "Q4865651",
        "Q6218463",
        "Q6765065",
        "Q7341481"
      ]
    },
    {
      "id": 407,
      "question": [
        {
          "string": "Has France won the Eurovision Song Contest?",
          "language": "en"
        },
        {
          "string": "¿Ha ganado Francia el Festival de la Canción de Eurovisión?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { ?sbj (wdt:P31/wdt:P279*)|^wdt:P527|wdt:P361 wd:Q110288240 . ?sbj p:P1346/(pq:P17|ps:P1346) wd:Q142 . }",
      "answers": [
        false
      ]
    },
    {
      "id": 235,
      "question": [
        {
          "string": "What movies were directed by Mira Nair?",
          "language": "en"
        },
        {
          "string": "¿Qué películas fueron dirigidas por Mira Nair?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q11424 . ?sbj wdt:P57 wd:Q466320 }",
      "answers": [
        "Q1046841",
        "Q11780529",
        "Q1557308",
        "Q1624299",
        "Q1637390",
        "Q1785725",
        "Q18156993",
        "Q20921603",
        "Q2734213",
        "Q3988967",
        "Q44935",
        "Q461447",
        "Q603857",
        "Q610097",
        "Q641324",
        "Q6946216",
        "Q945586"
      ]
    },
    {
      "id": 352,
      "question": [
        {
          "string": "How many members by gender does the Oireachtas have?",
          "language": "en"
        },
        {
          "string": "¿Cuántos integrantes por género tiene el Oireachtas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj2 (COUNT(DISTINCT ?sbj) as ?cnt) WHERE{ ?sbj p:P39 ?obj1 . ?obj1 ps:P39/wdt:P279*/wdt:P361* wd:Q129821 . ?sbj wdt:P21 ?obj2 MINUS { ?obj1 pq:P582 ?obj3 } } GROUP BY ?obj2",
      "answers": [
        "Q6581072",
        "71",
        "Q6581097",
        "163"
      ]
    },
    {
      "id": 332,
      "question": [
        {
          "string": "Which rugby union teams have had Chilean players?",
          "language": "en"
        },
        {
          "string": "¿Qué equipos de rugby a 15 han tenido jugadores chilenos?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj1 WHERE { ?sbj1 wdt:P31/wdt:P279* wd:Q14645593 . ?sbj2 wdt:P27 wd:Q298 . ?sbj2 wdt:P54 ?sbj1 . }",
      "answers": [
        "Q334657",
        "Q3462531",
        "Q3651754",
        "Q4120775",
        "Q84348017"
      ]
    },
    {
      "id": 349,
      "question": [
        {
          "string": "What is the proportion of presidents who have died in held position?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la proporción de presidentes que han muerto ejerciendo su cargo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?obj3) / COUNT(DISTINCT ?sbj) AS ?ratio) WHERE { { SELECT DISTINCT ?sbj ?obj3 WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39 ?obj2 . ?obj2 wdt:P31?/wdt:P279* wd:Q30461 . OPTIONAL { ?obj1 pq:P1534/wdt:P279* ?obj3 . FILTER(?obj3 = wd:Q99521170) } } } }",
      "answers": [
        "0.002486187845304"
      ]
    },
    {
      "id": 367,
      "question": [
        {
          "string": "Are dolphins mammals?",
          "language": "en"
        },
        {
          "string": "¿Los delfines son mamíferos?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q7369 (p:P31/pq:P642)?/(wdt:P279|wdt:P171)* wd:Q7377 }",
      "answers": [
        true
      ]
    },
    {
      "id": 201,
      "question": [
        {
          "string": "Where does Tim Berners-Lee currently work?",
          "language": "en"
        },
        {
          "string": "¿Dónde trabaja Tim Berners-Lee actualmente?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q80 p:P108|p:P1416 ?obj1 . ?obj1 ps:P108|ps:P1416 ?obj2 . MINUS { ?obj1 pq:P582 ?obj3 }  }",
      "answers": [
        "Q37033",
        "Q49108",
        "Q7095994",
        "Q7432436"
      ]
    },
    {
      "id": 240,
      "question": [
        {
          "string": "What religion is Joe Biden?",
          "language": "en"
        },
        {
          "string": "¿De qué religión es Joe Biden?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q6279 wdt:P140 ?obj  }",
      "answers": [
        "Q1841"
      ]
    },
    {
      "id": 267,
      "question": [
        {
          "string": "What is the second movie in the Terminator series?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la segunda película en la serie Terminator?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj p:P179 ?obj . ?obj ps:P179 wd:Q98063049 . ?obj pq:P1545 \"2\" }",
      "answers": [
        "Q170564"
      ]
    },
    {
      "id": 238,
      "question": [
        {
          "string": "How tall is the Al Hamra Tower?",
          "language": "en"
        },
        {
          "string": "¿Qué altura tiene Al Hamra Tower?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q557933 p:P2048/psn:P2048/wikibase:quantityAmount ?obj }",
      "answers": [
        "412.0"
      ]
    },
    {
      "id": 451,
      "question": [
        {
          "string": "What countries that border Ghana have a lower population than Ghana?",
          "language": "en"
        },
        {
          "string": "¿Qué países comparten un borde con Ghana y tienen una población menor que Ghana?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj1 WHERE { wd:Q117 wdt:P47 ?obj1 . wd:Q117 wdt:P1082 ?obj2 . ?obj1 wdt:P1082 ?obj3 . FILTER(?obj3 < ?obj2) }",
      "answers": [
        "Q1008",
        "Q945",
        "Q965"
      ]
    },
    {
      "id": 233,
      "question": [
        {
          "string": "Which movies were directed by alumni of the University of Bergen?",
          "language": "en"
        },
        {
          "string": "¿Qué películas fueron dirigidas por egresados de la Universidad de Bergen?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P57 ?obj . ?obj wdt:P69 wd:Q204457 . ?sbj wdt:P31/wdt:P279* wd:Q11424  }",
      "answers": [
        "Q104589294",
        "Q10712998",
        "Q11995287",
        "Q14918344",
        "Q1592308",
        "Q16171115",
        "Q17413100",
        "Q1765687",
        "Q20962283",
        "Q23705709",
        "Q33551429",
        "Q938294"
      ]
    },
    {
      "id": 493,
      "question": [
        {
          "string": "What elementary particles with neutral or positive charge interact with both the strong and weak forces?",
          "language": "en"
        },
        {
          "string": "¿Qué partículas elementales con carga neutra o positiva interactuan con la fuerza fuerte y la fuerza débil?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31*/wdt:P279* wd:Q43116 . ?sbj wdt:P517 wd:Q11415 . ?sbj wdt:P517 wd:Q11418 . ?sbj wdt:P2200 ?obj . FILTER(?obj >= 0) }",
      "answers": [
        "Q11905755",
        "Q11905758",
        "Q18481576",
        "Q6732",
        "Q6778"
      ]
    },
    {
      "id": 300,
      "question": [
        {
          "string": "What profession studies butterflies?",
          "language": "en"
        },
        {
          "string": "¿Qué profesión estudia las mariposas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31?/wdt:P279* wd:Q28640 . ?sbj wdt:P425/(wdt:P101|wdt:P2578)/^wdt:P171?/^wdt:P13176? wd:Q11946202 }",
      "answers": [
        "Q497294"
      ]
    },
    {
      "id": 501,
      "question": [
        {
          "string": "What binary neutron stars are in the constellation Scorpius?",
          "language": "en"
        },
        {
          "string": "¿Qué estrellas binarias de neutrones están en la constelación Escorpio?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q50053 . ?sbj wdt:P31/wdt:P279* wd:Q4202 . ?sbj wdt:P59 wd:Q8865 }",
      "answers": [
        "Q75998249",
        "Q76563373"
      ]
    },
    {
      "id": 168,
      "question": [
        {
          "string": "Who was the youngest president of the U.S.?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el presidente más joven de los EEUU?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39/^wdt:P1313 wd:Q30 . ?obj1 pq:P580 ?obj2 . ?sbj wdt:P569 ?obj3 . } ORDER BY ASC (?obj2-?obj3) LIMIT 1",
      "answers": [
        "Q33866"
      ]
    },
    {
      "id": 180,
      "question": [
        {
          "string": "What currency does Angola use?",
          "language": "en"
        },
        {
          "string": "¿Qué divisa se usa en Angola?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q916 wdt:P38 ?obj }",
      "answers": [
        "Q200337"
      ]
    },
    {
      "id": 230,
      "question": [
        {
          "string": "How many dwarf planets orbit the Sun?",
          "language": "en"
        },
        {
          "string": "¿Cuántos planetas enanos están en órbita del Sol?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(DISTINCT ?sbj) AS ?cnt) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q2199 . ?sbj wdt:P397 wd:Q525 }",
      "answers": [
        "7"
      ]
    },
    {
      "id": 232,
      "question": [
        {
          "string": "How heavy is a baseball?",
          "language": "en"
        },
        {
          "string": "¿Cuánto pesa una pelota de béisbol?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q791187 p:P2067/psn:P2067/wikibase:quantityAmount ?obj }",
      "answers": [
        "0.146"
      ]
    },
    {
      "id": 217,
      "question": [
        {
          "string": "Which record label released Kid A?",
          "language": "en"
        },
        {
          "string": "¿Qué sello discográfico tiene Kid A?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q220726 wdt:P264 ?obj }",
      "answers": [
        "Q193023",
        "Q208909"
      ]
    },
    {
      "id": 361,
      "question": [
        {
          "string": "Which Turing Award winners were born in Latin America?",
          "language": "en"
        },
        {
          "string": "¿Qué ganadores del Premio Turing nacieron en Latinoamérica?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT * WHERE { ?x wdt:P166 wd:Q185667 . ?x wdt:P19/wdt:P131*/wdt:P361* wd:Q12585 .  }",
      "answers": [
        "Q92626"
      ]
    },
    {
      "id": 488,
      "question": [
        {
          "string": "Did Lionel Messi play for FC Barcelona?",
          "language": "en"
        },
        {
          "string": "¿Jugaba Lionel Messi en el FC Barcelona?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q615 p:P54/ps:P54 wd:Q7156 }",
      "answers": [
        true
      ]
    },
    {
      "id": 435,
      "question": [
        {
          "string": "What other functionalist buildings have the same architect as the Tsentrosoyuz Building?",
          "language": "en"
        },
        {
          "string": "¿Qué otros edificios funcionalistas tienen el mismo arquitecto que el Edificio Tsentrosoyuz?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { wd:Q2454624 wdt:P84 ?obj . ?sbj wdt:P84 ?obj . ?sbj wdt:P149/wdt:P279* wd:Q47942 . FILTER (?sbj != wd:Q2454624) }",
      "answers": [
        "Q940746",
        "Q7126217"
      ]
    },
    {
      "id": 430,
      "question": [
        {
          "string": "Who was the architect of the Tsentrosoyuz Building?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el arquitecto del Edificio Tsentrosoyuz?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q2454624 wdt:P84 ?obj }",
      "answers": [
        "Q4724"
      ]
    },
    {
      "id": 311,
      "question": [
        {
          "string": "Has Kyra Phillips worked with ABC?",
          "language": "en"
        },
        {
          "string": "¿Ha trabajado Kyra Phillips con ABC?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q4484215 p:P108 ?obj1 . ?obj1 ps:P108 wd:Q169889 . }",
      "answers": [
        true
      ]
    },
    {
      "id": 251,
      "question": [
        {
          "string": "Which mountains were first ascended in the last eighty years?",
          "language": "en"
        },
        {
          "string": "¿Qué montañas fueron ascendidas por primera vez en los últimos ochenta años?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj p:P793 ?obj1 . ?sbj wdt:P31/wdt:P279 wd:Q8502 . ?obj1 ps:P793 wd:Q1194369 . ?obj1 pq:P585 ?obj2 . FILTER((YEAR(NOW()) - YEAR(?obj2)) <= 80) }",
      "answers": [
        "Q1189330",
        "Q1324394",
        "Q1945447",
        "Q2244727",
        "Q2269026",
        "Q840735"
      ]
    }
  ]
}