{
  "questions": [
    {
      "id": 377,
      "question": [
        {
          "string": "In which journals has Amrapali Zaveri published as first author?",
          "language": "en"
        },
        {
          "string": "¿En qué revistas ha publicado Amrapali Zaveri como primera autora?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { ?sbj p:P50 ?obj1 . ?obj1 ps:P50 wd:Q34315853 . ?obj1 pq:P1545 \"1\" . ?sbj wdt:P1433 ?obj2 . ?obj2 wdt:P31/wdt:P279* wd:Q41298 }",
      "answers": [
        "Q15708881",
        "Q15759214",
        "Q15817015",
        "Q18229272",
        "Q4724371",
        "Q564954",
        "Q924044"
      ]
    },
    {
      "id": 157,
      "question": [
        {
          "string": "Where did Stan Lee die?",
          "language": "en"
        },
        {
          "string": "¿Dónde murió Stan Lee?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q181900 wdt:P20 ?obj }",
      "answers": [
        "Q1052562"
      ]
    },
    {
      "id": 490,
      "question": [
        {
          "string": "Which parks in Perth are State Registered Places?",
          "language": "en"
        },
        {
          "string": "¿Qué parques en Perth son State Registered Places?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q22698 . ?sbj wdt:P131+ wd:Q3183 . ?sbj wdt:P1435 wd:Q56052054 }",
      "answers": [
        "Q14935818"
      ]
    },
    {
      "id": 346,
      "question": [
        {
          "string": "In which year did World War II start?",
          "language": "en"
        },
        {
          "string": "¿En qué año comenzó la Segunda Guerra Mundial?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?year WHERE { wd:Q362 wdt:P580 ?obj BIND(YEAR(?obj) AS ?year) }",
      "answers": [
        "1939"
      ]
    },
    {
      "id": 205,
      "question": [
        {
          "string": "What does Gyarados evolve from?",
          "language": "en"
        },
        {
          "string": "¿De qué evoluciona Gyarados?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj3 { wd:Q11074074 p:P361 ?obj1 . ?obj1 ps:P361 ?obj2 . ?obj2 wdt:P31 wd:Q15795637 . ?obj1 pq:P155 ?obj3 }",
      "answers": [
        "Q2822418"
      ]
    },
    {
      "id": 464,
      "question": [
        {
          "string": "Was Dubliners published before Ulysses?",
          "language": "en"
        },
        {
          "string": "¿Fue Dublineses publicado antes de Ulises?",
          "language": "es"
        }
      ],
      "sparql": "ASK { wd:Q459592 wdt:P577 ?obj1 . wd:Q6511 wdt:P577 ?obj2 . FILTER(?obj1 < ?obj2 ) }",
      "answers": [
        true
      ]
    },
    {
      "id": 416,
      "question": [
        {
          "string": "What is the latest movie featuring Harley Quinn?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la película más reciente que tiene Harley Quinn?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { SELECT ?obj (MIN(?obj2) as ?min) WHERE { wd:Q849477 wdt:P1441 ?obj . ?obj wdt:P577 ?obj2 . ?obj wdt:P31/wdt:P279* wd:Q11424 } GROUP BY ?obj } ORDER BY DESC(?min) LIMIT 1",
      "answers": [
        "Q57177410"
      ]
    },
    {
      "id": 225,
      "question": [
        {
          "string": "What team sports use sticks?",
          "language": "en"
        },
        {
          "string": "¿Qué deportes en equipo usan palos?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj (wdt:P31|wdt:P279)* wd:Q216048 . ?sbj wdt:P2283/(wdt:P31|wdt:P279)* wd:Q40044101 }",
      "answers": [
        "Q41466",
        "Q974015",
        "Q2194700",
        "Q206763",
        "Q5156775",
        "Q213711",
        "Q124366986",
        "Q1455",
        "Q183018",
        "Q86256934",
        "Q5375",
        "Q8031140",
        "Q185851",
        "Q5369"
      ]
    },
    {
      "id": 285,
      "question": [
        {
          "string": "Which country borders the most countries?",
          "language": "en"
        },
        {
          "string": "¿Qué país tiene frontera con el número máximo de países?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj { { SELECT ?sbj (COUNT(DISTINCT ?obj) as ?cnt) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P47 ?obj } GROUP BY ?sbj }  { SELECT (COUNT(DISTINCT ?obj) as ?cnt) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P47 ?obj } GROUP BY ?sbj ORDER BY DESC (COUNT(DISTINCT ?obj)) LIMIT 1 } }",
      "answers": [
        "Q159"
      ]
    },
    {
      "id": 370,
      "question": [
        {
          "string": "Where was Phobos discovered?",
          "language": "en"
        },
        {
          "string": "¿Dónde fue descubierto Fobos?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q7547 wdt:P65 ?obj }",
      "answers": [
        "Q11700"
      ]
    },
    {
      "id": 327,
      "question": [
        {
          "string": "Which video games have won the award of Best Esports Game of the Year at The Game Awards?",
          "language": "en"
        },
        {
          "string": "¿Qué videojuegos han ganado el premio de Mejor Juego de Esports del Año en The Game Awards?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q7889 . ?sbj wdt:P166 wd:Q104117257 . }",
      "answers": [
        "Q111165107",
        "Q18515944",
        "Q223341",
        "Q842146",
        "Q86919275"
      ]
    },
    {
      "id": 142,
      "question": [
        {
          "string": "Which countries border South Sudan?",
          "language": "en"
        },
        {
          "string": "¿Con qué países limita Sudan de Sur?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q958 wdt:P47 ?obj . ?obj wdt:P31/wdt:P279* wd:Q3624078 }",
      "answers": [
        "Q1036",
        "Q1049",
        "Q114",
        "Q115",
        "Q929",
        "Q974"
      ]
    },
    {
      "id": 171,
      "question": [
        {
          "string": "When was the Tunguska event?",
          "language": "en"
        },
        {
          "string": "¿Cuándo fue el bólido de Tunguska?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q125953 wdt:P585 ?obj }",
      "answers": [
        "1908-06-30T00:00:00Z"
      ]
    },
    {
      "id": 380,
      "question": [
        {
          "string": "What is the spin of a muon?",
          "language": "en"
        },
        {
          "string": "¿Qué espín tiene un muon?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q3151 wdt:P1122 ?obj }",
      "answers": [
        "0.5"
      ]
    },
    {
      "id": 261,
      "question": [
        {
          "string": "What religions promote vegetarianism?",
          "language": "en"
        },
        {
          "string": "¿Qué religiones promueven el vegetarianismo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31?/wdt:P279* wd:Q9174 . ?sbj wdt:P1552 wd:Q83364 . }",
      "answers": [
        "Q131165",
        "Q19750498",
        "Q9232"
      ]
    },
    {
      "id": 183,
      "question": [
        {
          "string": "Which sauces contain onion and garlic?",
          "language": "en"
        },
        {
          "string": "¿Qué salsas contienen cebolla y ajo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj (wdt:P31|wdt:P279)* wd:Q178359 . ?sbj wdt:P527+ wd:Q3406628 . ?sbj wdt:P527+ wd:Q21546392 . }",
      "answers": [
        "Q117288146",
        "Q12538673",
        "Q125604924",
        "Q127255886",
        "Q127255902",
        "Q178143",
        "Q2088642",
        "Q507816",
        "Q5965772",
        "Q82813109",
        "Q9004419"
      ]
    },
    {
      "id": 450,
      "question": [
        {
          "string": "Which football midfielders born in Senegal have played for France?",
          "language": "en"
        },
        {
          "string": "¿Qué mediocampistas de fútbol que nacieron en Senegal han jugado para Francia?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P19/wdt:P131*/wdt:P17? wd:Q1041 . ?sbj wdt:P54?/wdt:P106 wd:Q937857 . ?sbj wdt:P1532 wd:Q142 . ?sbj wdt:P413/wdt:P279* wd:Q193592 }",
      "answers": [
        "Q108924143",
        "Q12573096",
        "Q1381011",
        "Q342599",
        "Q46347"
      ]
    },
    {
      "id": 449,
      "question": [
        {
          "string": "Which football players born in Senegal have played for France and Inter Milan?",
          "language": "en"
        },
        {
          "string": "¿Qué futbolistas que nacieron en Senegal han jugado para Francia y para Inter Milan?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P19/wdt:P131*/wdt:P17? wd:Q1041 . ?sbj wdt:P54?/wdt:P106 wd:Q937857 . ?sbj wdt:P54 wd:Q631 . ?sbj wdt:P1532 wd:Q142 . }",
      "answers": [
        "Q46347"
      ]
    },
    {
      "id": 274,
      "question": [
        {
          "string": "What species are in the same genus as the monkeypox virus?",
          "language": "en"
        },
        {
          "string": "¿Qué especies están en el mismo género que el virus de la viruela del mono?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { wd:Q6900886 p:P31?/pq:P642?/wdt:P171+ ?obj . ?obj wdt:P105 wd:Q34740 . ?sbj wdt:P171+ ?obj . ?sbj wdt:P105 wd:Q7432 . FILTER(?sbj != wd:Q6900886) }",
      "answers": [
        "Q113127577",
        "Q11877169",
        "Q12418974",
        "Q1323732",
        "Q137360978",
        "Q18964870",
        "Q18964873",
        "Q18964876",
        "Q18964879",
        "Q1986297",
        "Q5025948",
        "Q92114628",
        "Q92114689"
      ]
    },
    {
      "id": 455,
      "question": [
        {
          "string": "In which religion is Ahura Mazda worshipped?",
          "language": "en"
        },
        {
          "string": "¿En qué religión es Ahura Mazda venerado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q179575 wdt:P1049 ?obj . ?obj wdt:P31/wdt:P279* wd:Q9174 }",
      "answers": [
        "Q3303092",
        "Q9601"
      ]
    },
    {
      "id": 153,
      "question": [
        {
          "string": "Who are the current Super Bowl champions?",
          "language": "en"
        },
        {
          "string": "¿Quiénes son los campeones actuales del Súper Tazón?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj2 WHERE { ?sbj wdt:P31|wdt:P3450 wd:Q32096 . ?sbj wdt:P585 ?obj1 . ?sbj wdt:P1346 ?obj2 } ORDER BY DESC(?obj1) LIMIT 1",
      "answers": [
        "Q219714"
      ]
    },
    {
      "id": 196,
      "question": [
        {
          "string": "Avressieux is located in which department of France?",
          "language": "en"
        },
        {
          "string": "¿Avressieux está ubicado en qué departamento de Francia?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q1223977 wdt:P131+ ?obj . ?obj wdt:P31 wd:Q6465 }",
      "answers": [
        "Q12745"
      ]
    },
    {
      "id": 313,
      "question": [
        {
          "string": "Was the Statue of Zeus at Olympia destroyed?",
          "language": "en"
        },
        {
          "string": "¿Fue destruida la Estatua de Zeus en Olimpia?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q46239 p:P793 ?obj1 . ?obj1 ps:P793 wd:Q17781833 . }",
      "answers": [
        true
      ]
    },
    {
      "id": 172,
      "question": [
        {
          "string": "Who was the U.S. president in 1984?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el presidente de los Estados Unidos en 1984?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39/^wdt:P1313 wd:Q30 . ?obj1 pq:P580 ?obj2 . ?obj1 pq:P582 ?obj3 . FILTER(YEAR(?obj2)<=1984 && YEAR(?obj3)>=1984) }",
      "answers": [
        "Q9960"
      ]
    },
    {
      "id": 440,
      "question": [
        {
          "string": "How many official languages of the European Union are not Indo-European?",
          "language": "en"
        },
        {
          "string": "¿Cuántas lenguas oficiales de la Unión Europea no son indoeuropeas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?obj) AS ?cnt) WHERE { wd:Q458 wdt:P37 ?obj . MINUS { ?obj wdt:P31?/wdt:P279* wd:Q19860 . } }",
      "answers": [
        "4"
      ]
    },
    {
      "id": 452,
      "question": [
        {
          "string": "What country that borders Ghana borders the most countries?",
          "language": "en"
        },
        {
          "string": "¿Qué país que comparte un borde con Ghana tiene el mayor número de vecinos?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj { { SELECT ?sbj (COUNT(DISTINCT ?obj) as ?cnt) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P47 ?obj . wd:Q117 wdt:P47 ?sbj  } GROUP BY ?sbj }  { SELECT (COUNT(DISTINCT ?obj) as ?cnt) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P47 ?obj . wd:Q117 wdt:P47 ?sbj } GROUP BY ?sbj ORDER BY DESC (COUNT(DISTINCT ?obj)) LIMIT 1 } }",
      "answers": [
        "Q965"
      ]
    },
    {
      "id": 462,
      "question": [
        {
          "string": "What age is the youngest head of state in the world?",
          "language": "en"
        },
        {
          "string": "¿Qué edad tiene el jefe de estado más joven del mundo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (YEAR(NOW())-YEAR(?obj2) - IF(MONTH(NOW())>MONTH(?obj2),0,IF(MONTH(NOW())=MONTH(?obj2) && DAY(NOW())>=DAY(?obj2),0,1)) AS ?age) WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P35 ?obj1 . ?obj1 wdt:P569 ?obj2 . FILTER(!isBlank(?obj2)) } ORDER BY DESC(?obj2) LIMIT 1",
      "answers": [
        "21"
      ]
    },
    {
      "id": 186,
      "question": [
        {
          "string": "What is the last line of Animal Farm?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la última línea de Animal Farm?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q1396889 wdt:P3132 ?obj . }",
      "answers": [
        "The creatures outside looked from pig to man, and from man to pig, and from pig to man again; but already it was impossible to say which was which."
      ]
    },
    {
      "id": 369,
      "question": [
        {
          "string": "Which Ethiopian political parties ended since 2000?",
          "language": "en"
        },
        {
          "string": "¿Qué partidos políticos etíopes se han disuelto desde 2000?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q7278 . ?sbj wdt:P17 wd:Q115 . ?sbj wdt:P576|wdt:P582 ?obj . FILTER(YEAR(?obj) > 2000) }",
      "answers": [
        "Q1135310",
        "Q1186157",
        "Q1186219",
        "Q19605729",
        "Q1966902",
        "Q257343",
        "Q280646",
        "Q491145",
        "Q766610"
      ]
    },
    {
      "id": 227,
      "question": [
        {
          "string": "What is the motto of the Jesuits?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el lema de los Jesuitas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q36380 wdt:P1451 ?obj }",
      "answers": [
        "Ad maiorem Dei gloriam"
      ]
    },
    {
      "id": 215,
      "question": [
        {
          "string": "Which banks operate in Algeria?",
          "language": "en"
        },
        {
          "string": "¿Qué bancos operan en Argelia?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q22687 . ?sbj wdt:P17 wd:Q262 }",
      "answers": [
        "Q1774622",
        "Q63759113",
        "Q86675373"
      ]
    },
    {
      "id": 498,
      "question": [
        {
          "string": "Which sauces are named after Italian cities?",
          "language": "en"
        },
        {
          "string": "¿Qué salsas deben sus nombres a ciudades italianas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj (wdt:P31|wdt:P279)* wd:Q178359 . ?sbj wdt:P138 ?obj . ?obj wdt:P31/wdt:P279* wd:Q515 }",
      "answers": [
        "Q116158085",
        "Q1162965",
        "Q1361859",
        "Q2019007",
        "Q2369993",
        "Q4886791",
        "Q5104402",
        "Q586770",
        "Q6728543"
      ]
    },
    {
      "id": 291,
      "question": [
        {
          "string": "What HBO series has the highest Tomatometer score?",
          "language": "en"
        },
        {
          "string": "¿Qué serie de HBO tiene el mejor puntaje de Tomatometer?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P449 wd:Q23633 . ?sbj wdt:P31/wdt:P279* wd:Q5398426 . ?sbj p:P444 ?obj1 . ?obj1 pq:P459 wd:Q108403393 . ?obj1 ps:P444 ?obj2 . { SELECT ?obj2 WHERE { ?sbj wdt:P449 wd:Q23633 . ?sbj wdt:P31/wdt:P279* wd:Q5398426 . ?sbj p:P444 ?obj1 . ?obj1 pq:P459 wd:Q108403393 . ?obj1 ps:P444 ?obj2 . BIND(xsd:integer(IF(CONTAINS(STR(?obj2),\"%\"),STRBEFORE(STR(?obj2),\"%\"),IF(CONTAINS(STR(?obj2),\"/\"),STRBEFORE(STR(?obj2),\"/\"),?obj2))) AS ?obj3) } ORDER BY DESC(?obj3) LIMIT 1 } }",
      "answers": [
        "Q4999826",
        "Q87131973"
      ]
    },
    {
      "id": 418,
      "question": [
        {
          "string": "Where did Violent Femmes form?",
          "language": "en"
        },
        {
          "string": "¿Dónde formó Violent Femmes?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q1134615 wdt:P740 ?obj }",
      "answers": [
        "Q1537"
      ]
    },
    {
      "id": 297,
      "question": [
        {
          "string": "What is the highest dan in Go?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el dan de Go más alto?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj p:P31 ?obj1 . ?obj1 ps:P31 ?obj2 . ?obj2 (wdt:P31|wdt:P279)* wd:Q373498 . ?obj2 wdt:P641 wd:Q11413 . ?obj1 pq:P1545 ?obj3 . } ORDER BY DESC(?obj3) LIMIT 1",
      "answers": [
        "Q12036922"
      ]
    },
    {
      "id": 216,
      "question": [
        {
          "string": "Which genus has the most species?",
          "language": "en"
        },
        {
          "string": "¿Qué género tiene más especies?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { ?sbj wdt:P105 wd:Q7432 . ?sbj wdt:P171+ ?obj . ?obj wdt:P105 wd:Q34740 . } GROUP BY ?obj ORDER BY DESC(COUNT(DISTINCT ?sbj)) LIMIT 1",
      "answers": [
        "Q16526"
      ]
    },
    {
      "id": 140,
      "question": [
        {
          "string": "How old was Daniel Day-Lewis when he won his first Academy Award?",
          "language": "en"
        },
        {
          "string": "¿Cuántos años tenía Daniel Day-Lewis cuando ganó su primer premio Óscar?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (MIN(YEAR(?obj5)-YEAR(?obj1) - IF(MONTH(?obj5)>MONTH(?obj1),0,IF(MONTH(?obj5)=MONTH(?obj1) && DAY(?obj5)>=DAY(?obj1),0,1))) AS ?age) WHERE { wd:Q166389 wdt:P569 ?obj1 . wd:Q166389 p:P166 ?obj2 . ?obj2 ps:P166 ?obj3 . ?obj3 wdt:P31 wd:Q19020 . ?obj2 pq:P805 ?obj4 . ?obj4 wdt:P585 ?obj5 . }",
      "answers": [
        "32"
      ]
    },
    {
      "id": 319,
      "question": [
        {
          "string": "Who are the sponsors of Barcelona football club?",
          "language": "en"
        },
        {
          "string": "¿Quiénes son patrocinadores del fútbol club Barcelona?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q7156 wdt:P859 ?obj }",
      "answers": [
        "Q132551",
        "Q689141"
      ]
    },
    {
      "id": 193,
      "question": [
        {
          "string": "Which parks are in Perth?",
          "language": "en"
        },
        {
          "string": "¿Qué parques están en Perth?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q22698 . ?sbj wdt:P131+ wd:Q3183 }",
      "answers": [
        "Q21933821",
        "Q21972312",
        "Q21972681",
        "Q14935818",
        "Q21933821",
        "Q21972404"
      ]
    },
    {
      "id": 154,
      "question": [
        {
          "string": "What are the official languages of Haiti?",
          "language": "en"
        },
        {
          "string": "¿Cuáles son los idiomas oficiales de Haití?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj { wd:Q790 wdt:P37 ?obj }",
      "answers": [
        "Q150",
        "Q33491"
      ]
    },
    {
      "id": 414,
      "question": [
        {
          "string": "Which of the two has a higher population: the United States or the European Union?",
          "language": "en"
        },
        {
          "string": "¿Cuál de los dos tiene la población más alta: los Estados Unidos o la Unión Europea?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { VALUES ?sbj { wd:Q30 wd:Q458 } ?sbj wdt:P1082 ?obj . } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q458"
      ]
    },
    {
      "id": 463,
      "question": [
        {
          "string": "What is the population of the capital of Qatar?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la población de la capital de Catar?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q846 wdt:P36 ?obj1 . ?obj1 wdt:P1082 ?obj2 . }",
      "answers": [
        "1186023.0"
      ]
    },
    {
      "id": 415,
      "question": [
        {
          "string": "Which of the two covers a larger area: the United States or the European Union?",
          "language": "en"
        },
        {
          "string": "¿Cuál de los dos tiene el área más alta: los Estados Unidos o la Unión Europea?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { VALUES ?sbj { wd:Q30 wd:Q458 } ?sbj wdt:P2046 ?obj . } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q30"
      ]
    },
    {
      "id": 491,
      "question": [
        {
          "string": "What parks in Perth are not State Registered Places?",
          "language": "en"
        },
        {
          "string": "¿Qué parques en Perth no son State Registered Places?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q22698 . ?sbj wdt:P131+ wd:Q3183 . MINUS { ?sbj wdt:P1435 wd:Q56052054 } }",
      "answers": [
        "Q21933821",
        "Q21933821",
        "Q21972312",
        "Q21972404",
        "Q21972681"
      ]
    },
    {
      "id": 203,
      "question": [
        {
          "string": "In which time zone is Tonga located?",
          "language": "en"
        },
        {
          "string": "¿En qué huso horario está Tonga?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q678 wdt:P421 ?obj }",
      "answers": [
        "Q7118",
        "Q7122271"
      ]
    },
    {
      "id": 129,
      "question": [
        {
          "string": "Which movies were filmed in Yemen?",
          "language": "en"
        },
        {
          "string": "¿Qué películas fueron producidas en Yemen?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q11424 . ?sbj wdt:P915/wdt:P131*/wdt:P17? wd:Q805 }",
      "answers": [
        "Q57157757",
        "Q57157757",
        "Q57157757",
        "Q60834962",
        "Q61876370",
        "Q113638069",
        "Q113638098",
        "Q113655294",
        "Q113655407",
        "Q113656464",
        "Q113656600",
        "Q113656609",
        "Q113656900",
        "Q113657213",
        "Q113667586"
      ]
    },
    {
      "id": 179,
      "question": [
        {
          "string": "How far is Alpha Centauri from Earth?",
          "language": "en"
        },
        {
          "string": "¿Qué tan lejos está Alfa Centauri de la Tierra?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q12176 p:P2583/psn:P2583/wikibase:quantityAmount ?obj }",
      "answers": [
        "41249088000000000.0"
      ]
    },
    {
      "id": 439,
      "question": [
        {
          "string": "Which official languages of the European Union are not Indo-European?",
          "language": "en"
        },
        {
          "string": "¿Qué lenguas oficiales de la Unión Europea no son indoeuropeas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q458 wdt:P37 ?obj . MINUS { ?obj wdt:P31?/wdt:P279* wd:Q19860 . } }",
      "answers": [
        "Q1412",
        "Q9067",
        "Q9072",
        "Q9166"
      ]
    },
    {
      "id": 437,
      "question": [
        {
          "string": "How many official languages of the European Union are there?",
          "language": "en"
        },
        {
          "string": "¿Cuántos idiomas oficiales hay de la Unión Europea?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?obj) AS ?cnt) { wd:Q458 wdt:P37 ?obj }",
      "answers": [
        "24"
      ]
    },
    {
      "id": 178,
      "question": [
        {
          "string": "What is the key of Space Oddity?",
          "language": "en"
        },
        {
          "string": "¿En qué tonalidad está compuesta Space Oddity?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q581952 wdt:P826 ?obj . }",
      "answers": [
        "Q913790"
      ]
    },
    {
      "id": 328,
      "question": [
        {
          "string": "When was J. K. Rowling born?",
          "language": "en"
        },
        {
          "string": "¿Cuándo nació J. K. Rowling?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q34660 wdt:P569 ?obj }",
      "answers": [
        "1965-07-31T00:00:00Z"
      ]
    },
    {
      "id": 256,
      "question": [
        {
          "string": "What movies are in the Matrix series?",
          "language": "en"
        },
        {
          "string": "¿Qué películas están en la serie Matrix?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P179 wd:Q1210827 . ?sbj wdt:P31/wdt:P279* wd:Q11424 }",
      "answers": [
        "Q189600",
        "Q207536",
        "Q80322391",
        "Q83495"
      ]
    },
    {
      "id": 190,
      "question": [
        {
          "string": "What is the highest Elo rating a chess player has achieved?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la puntuación Elo más alta que un jugador de ajedrez ha logrado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (MAX(?obj) AS ?max) WHERE { ?sbj p:P1087/ps:P1087 ?obj . }",
      "answers": [
        "2882.0"
      ]
    },
    {
      "id": 134,
      "question": [
        {
          "string": "How tall is Lana del Rey?",
          "language": "en"
        },
        {
          "string": "¿Cuánto mide Lana del Rey?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q37150 p:P2048/psn:P2048/wikibase:quantityAmount ?obj }",
      "answers": [
        "1.7"
      ]
    },
    {
      "id": 317,
      "question": [
        {
          "string": "How many Polish Grandmasters have there been?",
          "language": "en"
        },
        {
          "string": "¿Cuántos Gran Maestros Internacionales polacos ha habido?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?grandmaster) as ?count) WHERE { ?grandmaster wdt:P2962 wd:Q105269 .  ?grandmaster wdt:P27 wd:Q36 }",
      "answers": [
        "58"
      ]
    },
    {
      "id": 174,
      "question": [
        {
          "string": "Who is the richest person from Indonesia?",
          "language": "en"
        },
        {
          "string": "¿Quién es la persona más rica de Indonesia?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P2218 ?obj1 . ?sbj wdt:P27 wd:Q252 . ?obj1 a wikibase:BestRank . ?obj1 psv:P2218 ?obj2 . ?obj2 wikibase:quantityUnit wd:Q4917 . ?obj2 wikibase:quantityAmount ?obj3 . } ORDER BY DESC(?obj3) LIMIT 1",
      "answers": [
        "Q2156645"
      ]
    },
    {
      "id": 253,
      "question": [
        {
          "string": "How many floors does the Zifeng Tower have?",
          "language": "en"
        },
        {
          "string": "¿Cuántos pisos tiene la Torre Zifeng?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj3 WHERE { OPTIONAL { wd:Q382121 wdt:P1101 ?obj1 . } OPTIONAL { wd:Q382121 wdt:P1139 ?obj2 . } BIND(COALESCE(?obj1,0) + COALESCE(?obj2,0) AS ?obj3) }",
      "answers": [
        "71.0"
      ]
    },
    {
      "id": 484,
      "question": [
        {
          "string": "Which universities based in Peru were established before 1950?",
          "language": "en"
        },
        {
          "string": "¿Qué universidades en Perú fueron establecidas antes de 1950?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3918 . ?sbj wdt:P17 wd:Q419 . ?sbj wdt:P571 ?obj . FILTER(YEAR(?obj) < 1950) }",
      "answers": [
        "Q1634051",
        "Q200601",
        "Q270145",
        "Q3551703",
        "Q3551806",
        "Q5202236",
        "Q5202403",
        "Q539811",
        "Q5576631",
        "Q5784190",
        "Q6156603",
        "Q6979244",
        "Q7171165",
        "Q7413580",
        "Q7449465",
        "Q916367"
      ]
    },
    {
      "id": 211,
      "question": [
        {
          "string": "Who founded the New York Times?",
          "language": "en"
        },
        {
          "string": "¿Quién fundó the New York Times?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q9684 wdt:P112 ?obj }",
      "answers": [
        "Q164985",
        "Q5541162"
      ]
    },
    {
      "id": 242,
      "question": [
        {
          "string": "What is the flag of Tuvalu?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la bandera de Tuvalu?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q672 wdt:P163 ?obj }",
      "answers": [
        "Q105643"
      ]
    },
    {
      "id": 264,
      "question": [
        {
          "string": "What countries border Ghana?",
          "language": "en"
        },
        {
          "string": "¿Qué países comparten un borde con Ghana?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q117 wdt:P47 ?obj }",
      "answers": [
        "Q1008",
        "Q945",
        "Q965"
      ]
    }
  ]
}