{
  "questions": [
    {
      "id": 406,
      "question": [
        {
          "string": "In which year did France last host the Eurovision Song Contest?",
          "language": "en"
        },
        {
          "string": "¿En qué año patrocinó Francia el Festival de la Canción de Eurovisión por última vez?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { ?sbj (wdt:P31/wdt:P279*)|^wdt:P527|wdt:P361 wd:Q110288240 . ?sbj wdt:P585 ?obj1 . ?sbj wdt:P276?/wdt:P17 wd:Q142 . BIND(YEAR(?obj1) AS ?obj2) } ORDER BY DESC(?obj2) LIMIT 1",
      "answers": [
        "1978"
      ]
    },
    {
      "id": 442,
      "question": [
        {
          "string": "Who has declined a Fields Medal?",
          "language": "en"
        },
        {
          "string": "¿Quién ha rechazado una Medalla Fields?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj p:P166 ?obj . ?obj ps:P166 wd:Q28835 . ?obj pq:P793 wd:Q26252351 . }",
      "answers": [
        "Q117346"
      ]
    },
    {
      "id": 338,
      "question": [
        {
          "string": "Who was the first president of Chile?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el primer presidente de Chile?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39 wd:Q466956 . ?obj1 pq:P580 ?obj2 . } ORDER BY ?obj2 LIMIT 1",
      "answers": [
        "Q1331"
      ]
    },
    {
      "id": 169,
      "question": [
        {
          "string": "Who was the oldest president of the U.S. to take office?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el presidente de los EEUU más viejo al momento de su inauguración?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39/^wdt:P1313 wd:Q30 . ?obj1 pq:P580 ?obj2 . ?sbj wdt:P569 ?obj3 . } ORDER BY DESC (?obj2-?obj3) LIMIT 1",
      "answers": [
        "Q22686"
      ]
    },
    {
      "id": 441,
      "question": [
        {
          "string": "Does the European Union have any official languages that are not Indo-European?",
          "language": "en"
        },
        {
          "string": "¿Tiene la Unión Europea lenguas oficiales que no son indoeuropeas?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q458 wdt:P37 ?obj . MINUS { ?obj wdt:P31?/wdt:P279* wd:Q19860 . } }",
      "answers": [
        true
      ]
    },
    {
      "id": 226,
      "question": [
        {
          "string": "Which Latin American country has the highest Human Development Index?",
          "language": "en"
        },
        {
          "string": "¿Qué país latinoamericano tiene el índice de desarrollo humano más alto?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P361 wd:Q12585 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P1081 ?obj } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q414"
      ]
    },
    {
      "id": 141,
      "question": [
        {
          "string": "Has Daniel Day-Lewis won an Academy Award?",
          "language": "en"
        },
        {
          "string": "¿Ha ganado Daniel Day-Lewis un premio Óscar?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { wd:Q166389 wdt:P166 ?obj . ?obj wdt:P31 wd:Q19020 }",
      "answers": [
        true
      ]
    },
    {
      "id": 184,
      "question": [
        {
          "string": "What is the longest movie directed by Jane Campion?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la película más larga dirigida por Jane Campion?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P57 wd:Q230448 . ?sbj p:P2047/psn:P2047/wikibase:quantityAmount ?obj . ?sbj wdt:P31/wdt:P279* wd:Q11424 } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q1304431"
      ]
    },
    {
      "id": 363,
      "question": [
        {
          "string": "How much area does the Taj Mahal occupy?",
          "language": "en"
        },
        {
          "string": "¿Qué área ocupa el Taj Mahal?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q9141 p:P2046/psn:P2046/wikibase:quantityAmount ?obj }",
      "answers": [
        "170000.0"
      ]
    },
    {
      "id": 250,
      "question": [
        {
          "string": "How many people speak Urdu as a first language?",
          "language": "en"
        },
        {
          "string": "¿Cuántos hablan el urdu como su primera lengua?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q1617 p:P1098 ?obj1 . ?obj1 a wikibase:BestRank . ?obj1 pq:P518 wd:Q36870 . ?obj1 ps:P1098 ?obj2 }",
      "answers": [
        "68600000.0"
      ]
    },
    {
      "id": 388,
      "question": [
        {
          "string": "When did the Kangi famine start?",
          "language": "en"
        },
        {
          "string": "¿Cuándo empezó la hambruna de Kangi?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q11457474 wdt:P580 ?obj }",
      "answers": [
        "1230-01-01T00:00:00Z"
      ]
    },
    {
      "id": 188,
      "question": [
        {
          "string": "What is the tallest mountain in the world outside of Asia?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la montaña más alta en el mundo fuera de Asia?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q8502 . ?sbj p:P2044/psn:P2044/wikibase:quantityAmount ?obj1 . ?sbj wdt:P17 ?obj2 . MINUS { ?sbj wdt:P17/wdt:P30 wd:Q48 . } } ORDER BY DESC(?obj1) LIMIT 1",
      "answers": [
        "Q39739"
      ]
    },
    {
      "id": 286,
      "question": [
        {
          "string": "Which mathematician has the most followers on Twitter?",
          "language": "en"
        },
        {
          "string": "¿Qué matemático tiene el número máximo de seguidores en Twitter?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P106/wdt:P279* wd:Q170790 . ?sbj p:P8687 ?obj1 . ?obj1 pq:P2002|pq:P6552 ?obj2 . ?obj1 ps:P8687 ?obj3 } ORDER BY DESC(?obj3) LIMIT 1",
      "answers": [
        "Q380026"
      ]
    },
    {
      "id": 468,
      "question": [
        {
          "string": "What novels were written by Harper Lee?",
          "language": "en"
        },
        {
          "string": "¿Qué novelas fueron escritas por Harper Lee?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P7937 wd:Q8261 . ?sbj wdt:P50 wd:Q182658 . }",
      "answers": [
        "Q18949486",
        "Q212340"
      ]
    },
    {
      "id": 138,
      "question": [
        {
          "string": "How did Stan Lee die?",
          "language": "en"
        },
        {
          "string": "¿Cómo murió Stan Lee?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q181900 wdt:P509 ?obj . }",
      "answers": [
        "Q18558122"
      ]
    },
    {
      "id": 420,
      "question": [
        {
          "string": "Which songs from The Smiths have been covered and by whom?",
          "language": "en"
        },
        {
          "string": "¿Qué canciones de The Smiths  han sido versionadas y por quién?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj1 ?obj2 WHERE { ?sbj wdt:P2550 ?obj1 . ?obj1 wdt:P175 wd:Q180598 . ?sbj wdt:P175 ?obj2 . FILTER(?obj2 != wd:Q180598) }",
      "answers": [
        "Q1302678",
        "Q161723",
        "Q1302678",
        "Q2295716",
        "Q2468865",
        "Q2002188",
        "Q2468865",
        "Q273484"
      ]
    },
    {
      "id": 236,
      "question": [
        {
          "string": "What football players were convicted of tax fraud?",
          "language": "en"
        },
        {
          "string": "¿Qué futbolistas fueron condenados por fraude fiscal?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?s WHERE { ?s wdt:P106 wd:Q937857 . ?s wdt:P1399 wd:Q3806932 . }",
      "answers": [
        "Q615"
      ]
    },
    {
      "id": 237,
      "question": [
        {
          "string": "Who held the highest Elo rating in Israel's history?",
          "language": "en"
        },
        {
          "string": "¿Quién tuvo la mejor puntuación Elo en la historia de Israel?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P1087 ?obj1 . ?obj1 ps:P1087 ?obj2 . ?sbj wdt:P27 wd:Q801 . } ORDER BY DESC(?obj2) LIMIT 1",
      "answers": [
        "Q486778"
      ]
    },
    {
      "id": 266,
      "question": [
        {
          "string": "Which team did Wayne Gretzky join after the Edmonton Oilers?",
          "language": "en"
        },
        {
          "string": "¿Con qué equipo se juntó Wayne Gretzky después de los Edmonton Oilers?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj4 WHERE { wd:Q209518 p:P54 ?obj1 . ?obj1 ps:P54 wd:Q205973 . ?obj1 pq:P582 ?obj2 . wd:Q209518 p:P54 ?obj3 . ?obj3 ps:P54 ?obj4 . ?obj3 pq:P580 ?obj5 . FILTER(YEAR(?obj5) >= YEAR(?obj2) && ?obj1 != ?obj3) } ORDER BY ?obj5 LIMIT 1",
      "answers": [
        "Q203008"
      ]
    },
    {
      "id": 181,
      "question": [
        {
          "string": "What was the last movie that Chadwick Boseman starred in?",
          "language": "en"
        },
        {
          "string": "¿Cuál fue la última película en que protagonizó Chadwick Boseman?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P161 wd:Q5066520 . ?sbj wdt:P31/wdt:P279* wd:Q11424 . ?sbj wdt:P577 ?obj } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q65049470"
      ]
    },
    {
      "id": 320,
      "question": [
        {
          "string": "What video game series has sold the most units?",
          "language": "en"
        },
        {
          "string": "¿Qué serie de videojuegos ha vendido el mayor número de unidades?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q7058673 . ?sbj wdt:P2664 ?obj .} ORDER BY DESC (?obj) LIMIT 1",
      "answers": [
        "Q1046812"
      ]
    },
    {
      "id": 345,
      "question": [
        {
          "string": "For which team did Lionel Messi score the most goals?",
          "language": "en"
        },
        {
          "string": "¿Para qué equipo ha marcado Lionel Messi más goles?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj3 WHERE {  { SELECT ?obj3 ?obj2 WHERE { wd:Q615 p:P54 ?obj1 . ?obj1 pq:P1351 ?obj2 . ?obj1 ps:P54 ?obj3 } } { SELECT ?obj2 WHERE { wd:Q615 p:P54 ?obj1 . ?obj1 pq:P1351 ?obj2 . ?obj1 ps:P54 ?obj3 } ORDER BY DESC(?obj2) LIMIT 1 } }",
      "answers": [
        "Q7156"
      ]
    },
    {
      "id": 354,
      "question": [
        {
          "string": "Which online streamers studied at the University of Waterloo?",
          "language": "en"
        },
        {
          "string": "¿Qué streamers estudiaron en la Universidad de Waterloo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P106/wdt:P279* wd:Q57414145 . ?sbj wdt:P69 wd:Q1049470 . }",
      "answers": [
        "Q21555185",
        "Q59240315"
      ]
    },
    {
      "id": 478,
      "question": [
        {
          "string": "How many countries are part of the G20 and the Arab League?",
          "language": "en"
        },
        {
          "string": "¿Cuántos países forman parte de la G20 y la Liga Árabe?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT (DISTINCT ?sbj) AS ?cnt) WHERE { ?sbj wdt:P463 wd:Q19771 . ?sbj wdt:P463 wd:Q7172 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 }",
      "answers": [
        "1"
      ]
    },
    {
      "id": 400,
      "question": [
        {
          "string": "Which countries are in the Balkan region?",
          "language": "en"
        },
        {
          "string": "¿Qué países están en la región de los Balcanes?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3624078 . ?sbj wdt:P706|wdt:P361|wdt:P131 wd:Q23522 }",
      "answers": [
        "Q215",
        "Q219",
        "Q221",
        "Q222",
        "Q224",
        "Q225",
        "Q236",
        "Q403",
        "Q41",
        "Q43"
      ]
    },
    {
      "id": 221,
      "question": [
        {
          "string": "Who was first to climb Ľadový štít?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el primero en subir el Ľadový štít?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE { wd:Q344647 p:P793 ?obj1 . ?obj1 ps:P793 wd:Q1194369 . ?obj1 pq:P710 ?obj2 }",
      "answers": [
        "Q29297",
        "Q957519"
      ]
    },
    {
      "id": 427,
      "question": [
        {
          "string": "Which saints have their feast day on Desmond Tutu's birthday?",
          "language": "en"
        },
        {
          "string": "¿Qué santos tienen su festividad religiosa en el cumpleaños de Desmond Tutu?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj1 WHERE { ?sbj1 wdt:P841/wdt:P837? ?sbj2 . ?sbj1 wdt:P411/wdt:P279* wd:Q43115 . { wd:Q43033 wdt:P3150 ?sbj2 } UNION { wd:Q43033 wdt:P569 ?obj . ?sbj2 wdt:P31 wd:Q14795564 . ?sbj2 p:P361 ?obj1 . ?obj1 ps:P361/p:P31/pq:P1545 ?obj2 . ?obj1 pq:P1545 ?obj3 . FILTER(MONTH(?obj) = xsd:integer(?obj2) && DAY(?obj) = xsd:integer(?obj3)) }  }",
      "answers": [
        "Q132797",
        "Q140013",
        "Q22955657",
        "Q2488951",
        "Q278330",
        "Q2878201",
        "Q288295",
        "Q3361486",
        "Q3604959",
        "Q3629720",
        "Q3761223",
        "Q4417154",
        "Q6756480"
      ]
    },
    {
      "id": 366,
      "question": [
        {
          "string": "What distance is a marathon?",
          "language": "en"
        },
        {
          "string": "¿Qué distancia tiene un maratón?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q40244 p:P3157/psn:P3157/wikibase:quantityAmount ?obj .  }",
      "answers": [
        "42195.0"
      ]
    },
    {
      "id": 340,
      "question": [
        {
          "string": "How many siblings does Cristiano Ronaldo have?",
          "language": "en"
        },
        {
          "string": "¿Cuántos hermanos tiene Cristiano Ronaldo?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(?obj) AS ?count) WHERE { wd:Q11571 wdt:P3373 ?obj . }",
      "answers": [
        "3"
      ]
    },
    {
      "id": 224,
      "question": [
        {
          "string": "Who are the developers of SPSS?",
          "language": "en"
        },
        {
          "string": "¿Quién es el desarrollador de SPSS?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q181596 wdt:P178 ?obj }",
      "answers": [
        "Q132888041",
        "Q135419999",
        "Q37156",
        "Q7052308"
      ]
    },
    {
      "id": 394,
      "question": [
        {
          "string": "On which planet is the Mona Lisa crater?",
          "language": "en"
        },
        {
          "string": "¿En qué planeta está el cráter de Mona Lisa?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q3320058 wdt:P376 ?obj }",
      "answers": [
        "Q313"
      ]
    },
    {
      "id": 502,
      "question": [
        {
          "string": "Which paintings by Camille Pissarro were stolen?",
          "language": "en"
        },
        {
          "string": "¿Qué pinturas de Camille Pissarro fueron robadas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P170 wd:Q134741 . ?sbj wdt:P31/wdt:P279* wd:Q3305213 . ?sbj wdt:P793 ?obj . ?obj (wdt:P31|wdt:P279)* wd:Q2727213 }",
      "answers": [
        "Q121088797",
        "Q16984993",
        "Q17491806",
        "Q1810348",
        "Q21290014",
        "Q22115548",
        "Q29842733"
      ]
    },
    {
      "id": 197,
      "question": [
        {
          "string": "What is the constellation of OGLE BLG-ECL-143281?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la constelación de OGLE BLG-ECL-143281?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q76570685 wdt:P59 ?obj }",
      "answers": [
        "Q8866"
      ]
    },
    {
      "id": 234,
      "question": [
        {
          "string": "Who stars in Sharknado?",
          "language": "en"
        },
        {
          "string": "¿Quién actuó en Sharknado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q13794921 wdt:P161 ?obj }",
      "answers": [
        "Q162035",
        "Q211082",
        "Q3434296",
        "Q352233",
        "Q462327",
        "Q5711332",
        "Q723751",
        "Q900426"
      ]
    },
    {
      "id": 278,
      "question": [
        {
          "string": "What is the time-zone of Aligarh?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el huso horario de Aligarh?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q201832 wdt:P421 ?obj }",
      "answers": [
        "Q6828"
      ]
    },
    {
      "id": 150,
      "question": [
        {
          "string": "Does South Korea have a prime minister?",
          "language": "en"
        },
        {
          "string": "¿Tiene Corea del Sur un primer ministro?",
          "language": "es"
        }
      ],
      "sparql": "ASK WHERE { ?sbj wdt:P31*/wdt:P279* wd:Q14212 . ?sbj wdt:P1001 wd:Q884 }",
      "answers": [
        true
      ]
    },
    {
      "id": 245,
      "question": [
        {
          "string": "What is the heaviest Pokémon?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el Pokémon más pesado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3966183 . ?sbj p:P2067/psn:P2067/wikibase:quantityAmount ?obj } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q1070682"
      ]
    },
    {
      "id": 492,
      "question": [
        {
          "string": "What elementary particles with negative charge interact with both the strong and weak forces?",
          "language": "en"
        },
        {
          "string": "¿Qué partículas elementales con carga negativa interactuan con la fuerza fuerte y la fuerza débil?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31*/wdt:P279* wd:Q43116 . ?sbj wdt:P517 wd:Q11415 . ?sbj wdt:P517 wd:Q11418 . ?sbj wdt:P2200 ?obj . FILTER(?obj < 0) }",
      "answers": [
        "Q11905753",
        "Q11905754",
        "Q18481607",
        "Q6745",
        "Q6763",
        "Q6786"
      ]
    },
    {
      "id": 289,
      "question": [
        {
          "string": "What is black's second move in the Catalan Opening?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la segunda jugada de las negras en la apertura catalana?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj3 WHERE { wd:Q1138488 p:P5286 ?obj1 . ?obj1 pq:P1545 \"2\" . ?obj1 ps:P5286 ?obj2 . BIND(STRAFTER(STR(?obj2),\" \") AS ?obj3) }",
      "answers": [
        "e6"
      ]
    },
    {
      "id": 412,
      "question": [
        {
          "string": "Has France won the Eurovision at least thrice?",
          "language": "en"
        },
        {
          "string": "¿Ha ganado Francia el Festival de la Canción de Eurovisión al menos tres veces?",
          "language": "es"
        }
      ],
      "sparql": "ASK { { SELECT (COUNT(DISTINCT ?sbj) AS ?cnt) { ?sbj (wdt:P31/wdt:P279*)|^wdt:P527|wdt:P361 wd:Q110288240 . ?sbj p:P1346/(pq:P17|ps:P1346) wd:Q142 . } } FILTER(?cnt >= 3) }",
      "answers": [
        false
      ]
    },
    {
      "id": 144,
      "question": [
        {
          "string": "What is the motto of the Data Link Institute?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el lema del Data Link Institute?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q105078719 wdt:P1451 ?obj }",
      "answers": [
        "Ploughing minds for service"
      ]
    },
    {
      "id": 202,
      "question": [
        {
          "string": "Which New Zealand cyclists participated in the 2000 Summer Olympics?",
          "language": "en"
        },
        {
          "string": "¿Qué ciclistas de Nueva Zelanda participaron en los Juegos Olímpicos de verano de 2000?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P106/wdt:P279* wd:Q2125610 . ?sbj wdt:P27|wdt:P1532 wd:Q664 . ?sbj wdt:P1344 wd:Q8544 }",
      "answers": [
        "Q11770868",
        "Q1299266",
        "Q1494815",
        "Q176489",
        "Q18402356",
        "Q19757567",
        "Q19876156",
        "Q257126",
        "Q27058000",
        "Q286813",
        "Q2966600",
        "Q463687",
        "Q4961153",
        "Q573758",
        "Q7367248",
        "Q7649835",
        "Q772321",
        "Q7803285"
      ]
    },
    {
      "id": 158,
      "question": [
        {
          "string": "What museums are in Addis Ababa?",
          "language": "en"
        },
        {
          "string": "¿Qué museos están en Adís Abeba?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q33506 . ?sbj wdt:P276?/wdt:P131* wd:Q3624 . }",
      "answers": [
        "Q115101919",
        "Q15856263",
        "Q20982459",
        "Q2652168",
        "Q55603199",
        "Q56072786",
        "Q6585314",
        "Q73802179",
        "Q94993165"
      ]
    },
    {
      "id": 335,
      "question": [
        {
          "string": "What is the fastest automobile model?",
          "language": "en"
        },
        {
          "string": "¿Cuál es el modelo de automóvil más rápido?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q3231690 . ?sbj p:P2052/psn:P2052/wikibase:quantityAmount ?obj. } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q56248862"
      ]
    },
    {
      "id": 164,
      "question": [
        {
          "string": "What are the colors of the French flag?",
          "language": "en"
        },
        {
          "string": "¿Qué colores tiene la bandera francés?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj { wd:Q43192 wdt:P462 ?obj }",
      "answers": [
        "Q1088",
        "Q23444",
        "Q3142"
      ]
    },
    {
      "id": 283,
      "question": [
        {
          "string": "How many students attend the University of Liège?",
          "language": "en"
        },
        {
          "string": "¿Cuántos estudiantes asisten a la Universidad de Lieja?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q1334582 wdt:P2196 ?obj }",
      "answers": [
        "27678.0"
      ]
    },
    {
      "id": 136,
      "question": [
        {
          "string": "How many kilometers are in a lightyear?",
          "language": "en"
        },
        {
          "string": "¿Cuántos kilómetros están en un año luz?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj3 WHERE { wd:Q531 p:P2442 ?obj1 . ?obj1 psv:P2442 ?obj2 . ?obj2 wikibase:quantityAmount ?obj3 .  ?obj2 wikibase:quantityUnit wd:Q828224 . }",
      "answers": [
        "9460730472581.0"
      ]
    },
    {
      "id": 457,
      "question": [
        {
          "string": "What element has atomic number 19?",
          "language": "en"
        },
        {
          "string": "¿Qué elemento tiene el número atómico 19?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P1086 ?obj . ?sbj wdt:P31/wdt:P279* wd:Q11344 . FILTER(?obj = 19) }",
      "answers": [
        "Q703"
      ]
    },
    {
      "id": 445,
      "question": [
        {
          "string": "Which U.S. Presidents were born during World War II?",
          "language": "en"
        },
        {
          "string": "¿Qué presidentes estadounidenses nacieron durante la Segunda Guerra Mundial?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT * WHERE { ?sbj wdt:P39 wd:Q11696 . ?sbj wdt:P569 ?obj1 . wd:Q362 wdt:P580 ?obj2 . wd:Q362 wdt:P582 ?obj3 . FILTER(?obj1 >= ?obj2 && ?obj1 <= ?obj3) }",
      "answers": [
        "Q6279",
        "1942-11-20T00:00:00Z",
        "1939-09-01T00:00:00Z",
        "1945-09-02T00:00:00Z"
      ]
    },
    {
      "id": 476,
      "question": [
        {
          "string": "How many countries are members of the G20?",
          "language": "en"
        },
        {
          "string": "¿Cuántos países son miembros de la G20?",
          "language": "es"
        }
      ],
      "sparql": "SELECT (COUNT(DISTINCT ?sbj) AS ?cnt) WHERE { ?sbj wdt:P463 wd:Q19771 . ?sbj wdt:P31/wdt:P279* wd:Q3624078 . }",
      "answers": [
        "19"
      ]
    },
    {
      "id": 132,
      "question": [
        {
          "string": "How far away is IRAS 14038-3450 from Earth?",
          "language": "en"
        },
        {
          "string": "¿Qué tan lejos está IRAS 14038-3450 de la Tierra?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q80655009 p:P2583/psn:P2583/wikibase:quantityAmount ?obj . }",
      "answers": [
        "75600000000000000000.0"
      ]
    },
    {
      "id": 249,
      "question": [
        {
          "string": "When did Islam begin?",
          "language": "en"
        },
        {
          "string": "¿Cuándo empezó el Islam?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q432 wdt:P571 ?obj }",
      "answers": [
        "0631-01-01T00:00:00Z"
      ]
    },
    {
      "id": 506,
      "question": [
        {
          "string": "What was the last entirely or partially black and white movie to win an Academy Award for Best Picture?",
          "language": "en"
        },
        {
          "string": "¿Cuál fue la última película entera o parcialmente en blanco y negro que ganó un Óscar a la mejor película?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P166 ?obj1 . ?obj1 ps:P166 wd:Q102427 . ?obj1 pq:P585 ?obj2 . ?sbj wdt:P462 wd:Q838368 } ORDER BY DESC(?obj2) LIMIT 1",
      "answers": [
        "Q108839994"
      ]
    },
    {
      "id": 147,
      "question": [
        {
          "string": "Who composed the national anthem of Tonga?",
          "language": "en"
        },
        {
          "string": "¿Quién compuso el himno nacional de Tonga?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj2 WHERE {  wd:Q678 wdt:P85 ?obj1 . ?obj1 wdt:P86 ?obj2 . }",
      "answers": [
        "Q4525745"
      ]
    },
    {
      "id": 263,
      "question": [
        {
          "string": "Which channel originally broadcast Black Books?",
          "language": "en"
        },
        {
          "string": "¿Qué canal difundió Black Books originalmente?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?obj WHERE { wd:Q880114 wdt:P449 ?obj }",
      "answers": [
        "Q501070"
      ]
    },
    {
      "id": 170,
      "question": [
        {
          "string": "Who was the oldest president of the U.S. in office?",
          "language": "en"
        },
        {
          "string": "¿Quién fue el presidente más viejo de los EEUU en ejercicio?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?sbj WHERE { ?sbj p:P39 ?obj1 . ?obj1 ps:P39/^wdt:P1313 wd:Q30 . ?sbj wdt:P569 ?obj3 . OPTIONAL{ ?obj1 pq:P582 ?obj2 . } BIND(COALESCE(?obj2,NOW()) AS ?obj4) } ORDER BY DESC (?obj4-?obj3) LIMIT 1",
      "answers": [
        "Q6279"
      ]
    },
    {
      "id": 161,
      "question": [
        {
          "string": "Who directed Sharknado?",
          "language": "en"
        },
        {
          "string": "¿Quién dirigió Sharknado?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?obj WHERE { wd:Q13794921 wdt:P57 ?obj }",
      "answers": [
        "Q16146485"
      ]
    },
    {
      "id": 348,
      "question": [
        {
          "string": "What are the 10 most common surnames of soccer players?",
          "language": "en"
        },
        {
          "string": "¿Cuáles son los 10 apellidos más comunes de futbolistas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT ?surname WHERE { ?person wdt:P106 wd:Q937857. ?person wdt:P734 ?surname. } GROUP BY ?surname ORDER BY DESC(COUNT(DISTINCT ?person)) LIMIT 10",
      "answers": [
        "Q1158446",
        "Q13083721",
        "Q5576697",
        "Q980636",
        "Q59853",
        "Q13421990",
        "Q11983535",
        "Q1688722",
        "Q1158701",
        "Q6327150"
      ]
    },
    {
      "id": 500,
      "question": [
        {
          "string": "Which Italian sauces are named after Italian cities?",
          "language": "en"
        },
        {
          "string": "¿Qué salsas italianas deben sus nombres a ciudades italianas?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj (wdt:P31|wdt:P279)* wd:Q178359 . ?sbj wdt:P138 ?obj . ?obj wdt:P31/wdt:P279* wd:Q515 . ?obj wdt:P17 wd:Q38 }",
      "answers": [
        "Q1162965",
        "Q4886791",
        "Q586770"
      ]
    },
    {
      "id": 306,
      "question": [
        {
          "string": "What is the largest moon of the Solar System by mass?",
          "language": "en"
        },
        {
          "string": "¿Cuál es la luna más grande del Sistema Solar por masa?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q2537 . ?sbj wdt:P397+ wd:Q525 . ?sbj p:P2067/psn:P2067/wikibase:quantityAmount ?obj . } ORDER BY DESC(?obj) LIMIT 1",
      "answers": [
        "Q3169"
      ]
    },
    {
      "id": 460,
      "question": [
        {
          "string": "Which carbon isotopes can decay into boron isotopes via electron capture?",
          "language": "en"
        },
        {
          "string": "¿Qué isótopos de carbono pueden desintegrarse en isótopos de boro mediante la captura electrónica?",
          "language": "es"
        }
      ],
      "sparql": "SELECT DISTINCT ?sbj WHERE { ?sbj wdt:P31/wdt:P279* wd:Q471790 . ?sbj p:P816 ?obj1 . ?obj1 ps:P816 ?obj2 . ?obj2 wdt:P31/wdt:P279* wd:Q464352 . ?obj1 pq:P817 wd:Q109910 }",
      "answers": [
        "Q1014081",
        "Q3658304",
        "Q3658308"
      ]
    }
  ]
}